[
  {
    "country_name": "South Georgia",
    "country_description": "South Georgia is an island in the South Atlantic Ocean that is part of the British Overseas Territory of South Georgia and the South Sandwich Islands. It lies around 1,400 kilometres (870 mi) east of the Falkland Islands. Stretching in the east–west direction, South Georgia is around 170 kilometres (106 mi) long and has a maximum width of 35 kilometres (22 mi). The terrain is mountainous, with the central ridge rising to 2,935 metres (9,629 ft) at Mount Paget. The northern coast is indented with numerous bays and fjords, serving as good harbours.",
    "country_capital": "King Edward Point",
    "country_population": 30,
    "country_continent": "Antarctic",
    "country_language": "English",
    "country_currency": "Saint Helena pound (£)",
    "country_flag": "https://flagcdn.com/gs.svg"
  },
  {
    "country_name": "Grenada",
    "country_description": "Grenada is an island country of the West Indies in the eastern Caribbean Sea. The southernmost of the Windward Islands, Grenada is directly south of Saint Vincent and the Grenadines and about 100 miles (160 km) north of Trinidad and the South American mainland.",
    "country_capital": "St. George's",
    "country_population": 112519,
    "country_continent": "Americas",
    "country_language": "English",
    "country_currency": "Eastern Caribbean dollar ($)",
    "country_flag": "https://flagcdn.com/gd.svg"
  },
  {
    "country_name": "Switzerland",
    "country_description": "Switzerland, officially the Swiss Confederation, is a landlocked country located in west-central Europe. It is bordered by Italy to the south, France to the west, Germany to the north, and Austria and Liechtenstein to the east. Switzerland is geographically divided among the Swiss Plateau, the Alps and the Jura; the Alps occupy the greater part of the territory, whereas most of the country's 9 million people are concentrated on the plateau, which hosts its largest cities and economic centres, including Zurich, Geneva, and Basel.",
    "country_capital": "Bern",
    "country_population": 8654622,
    "country_continent": "Europe",
    "country_language": "French",
    "country_currency": "Swiss franc (Fr.)",
    "country_flag": "https://flagcdn.com/ch.svg"
  },
  {
    "country_name": "Sierra Leone",
    "country_description": "Sierra Leone, officially the Republic of Sierra Leone, is a country on the southwest coast of West Africa. It is bordered to the southeast by Liberia and by Guinea to the north. Its land area is 71,740 km2 (27,699 sq mi). It has a tropical climate and environments ranging from savannas to rainforests. As of the 2023 census, Sierra Leone has a population of 8,908,040. Freetown is both its capital and its largest city. The country is divided into five administrative regions, which are further subdivided into 16 districts.",
    "country_capital": "Freetown",
    "country_population": 7976985,
    "country_continent": "Africa",
    "country_language": "English",
    "country_currency": "Sierra Leonean leone (Le)",
    "country_flag": "https://flagcdn.com/sl.svg"
  },
  {
    "country_name": "Hungary",
    "country_description": "Hungary is a landlocked country in Central Europe. Spanning 93,030 square kilometres (35,920 sq mi) of the Carpathian Basin, it is bordered by Slovakia to the north, Ukraine to the northeast, Romania to the east and southeast, Serbia to the south, Croatia and Slovenia to the southwest, and Austria to the west. Hungary has a population of 9.5 million, mostly ethnic Hungarians and a significant Romani minority. Hungarian is the official language and Budapest is the country's capital and largest city.",
    "country_capital": "Budapest",
    "country_population": 9749763,
    "country_continent": "Europe",
    "country_language": "Hungarian",
    "country_currency": "Hungarian forint (Ft)",
    "country_flag": "https://flagcdn.com/hu.svg"
  },
  {
    "country_name": "Taiwan",
    "country_description": "Taiwan, officially the Republic of China (ROC), is a country in East Asia. The main island of Taiwan, also known as Formosa, lies between the East and South China Seas in the northwestern Pacific Ocean, with the People's Republic of China (PRC) to the northwest, Japan to the northeast, and the Philippines to the south. It has an area of 35,808 square kilometres, with mountain ranges dominating the eastern two-thirds and plains in the western third, where its highly urbanized population is concentrated. The combined territories under ROC control consist of 168 islands in total covering 36,193 square kilometres. The largest metropolitan area is formed by Taipei, New Taipei City, and Keelung. With around 23.9 million inhabitants, Taiwan is among the most densely populated countries.",
    "country_capital": "Taipei",
    "country_population": 23503349,
    "country_continent": "Asia",
    "country_language": "Chinese",
    "country_currency": "New Taiwan dollar ($)",
    "country_flag": "https://flagcdn.com/tw.svg"
  },
  {
    "country_name": "Wallis and Futuna",
    "country_description": "Wallis and Futuna, officially the Territory of the Wallis and Futuna Islands, is a French island collectivity in the South Pacific, situated between Tuvalu to the northwest, Fiji to the southwest, Tonga to the southeast, Samoa to the east, and Tokelau to the northeast.",
    "country_capital": "Mata-Utu",
    "country_population": 11750,
    "country_continent": "Oceania",
    "country_language": "French",
    "country_currency": "CFP franc (₣)",
    "country_flag": "https://flagcdn.com/wf.svg"
  },
  {
    "country_name": "Barbados",
    "country_description": "Barbados is an island country in the Lesser Antilles of the West Indies, in the Caribbean region next to North America and north of\nSouth America, and is the most easterly of the Caribbean islands. It lies on the boundary of the South American and Caribbean plates. Its capital and largest city is Bridgetown.",
    "country_capital": "Bridgetown",
    "country_population": 287371,
    "country_continent": "Americas",
    "country_language": "English",
    "country_currency": "Barbadian dollar ($)",
    "country_flag": "https://flagcdn.com/bb.svg"
  },
  {
    "country_name": "Pitcairn Islands",
    "country_description": "The Pitcairn Islands, officially Pitcairn, Henderson, Ducie and Oeno Islands, are a group of four volcanic islands in the southern Pacific Ocean that form the sole British Overseas Territory in the Pacific Ocean. The four islands—Pitcairn, Henderson, Ducie and Oeno—are scattered across several hundred kilometres of ocean and have a combined land area of about 47 square kilometres. Henderson Island accounts for 86% of the land area, but only Pitcairn Island is inhabited. The inhabited islands nearest to the Pitcairn Islands are Mangareva, 688 km to the west, as well as Easter Island, 1,929 km to the east.",
    "country_capital": "Adamstown",
    "country_population": 56,
    "country_continent": "Oceania",
    "country_language": "English",
    "country_currency": "New Zealand dollar ($)",
    "country_flag": "https://flagcdn.com/pn.svg"
  },
  {
    "country_name": "Ivory Coast",
    "country_description": "Ivory Coast, also known as Côte d'Ivoire and officially the Republic of Côte d'Ivoire, is a country on the southern coast of West Africa. Its capital city of Yamoussoukro is located in the centre of the country, while its largest city and economic centre is the port city of Abidjan. It borders Guinea to the northwest, Liberia to the west, Mali to the northwest, Burkina Faso to the northeast, Ghana to the east, and the Atlantic Ocean's Gulf of Guinea to the south. With 31.5 million inhabitants in 2024, Ivory Coast is the third-most populous country in West Africa. Its official language is French, and indigenous languages are also widely used, including Bété, Baoulé, Dyula, Dan, Anyin, and Cebaara Senufo. In total, there are around 78 languages spoken in Ivory Coast. The country has a religiously diverse population, including numerous followers of Islam, Christianity, and traditional faiths often entailing animism.",
    "country_capital": "Yamoussoukro",
    "country_population": 26378275,
    "country_continent": "Africa",
    "country_language": "French",
    "country_currency": "West African CFA franc (Fr)",
    "country_flag": "https://flagcdn.com/ci.svg"
  },
  {
    "country_name": "Tunisia",
    "country_description": "Tunisia, officially the Republic of Tunisia, is the northernmost country in Africa. It is a part of the Maghreb region of North Africa, bordered by Algeria to the west and southwest, Libya to the southeast, and the Mediterranean Sea to the north and east. Tunisia also shares maritime borders with Italy through the islands of Sicily and Sardinia to the north and Malta to the east. It features the archaeological sites of Carthage dating back to the 9th century BC, as well as the Great Mosque of Kairouan. Known for its ancient architecture, souks, and blue coasts, it covers 163,610 km2 (63,170 sq mi), and has a population of 12.1 million. It contains the eastern end of the Atlas Mountains and the northern reaches of the Sahara desert; much of its remaining territory is arable land. Its 1,300 km (810 mi) of coastline includes the African conjunction of the western and eastern parts of the Mediterranean Basin. Tunisia is home to Africa's northernmost point, Cape Angela. Located on the northeastern coast, Tunis is the capital and largest city of the country, which is itself named after Tunis. The official language of Tunisia is Modern Standard Arabic. The vast majority of Tunisia's population is Arab and Muslim. Vernacular Tunisian Arabic is the most spoken, and French also serves as an administrative and educational language in some contexts, but it has no official status.",
    "country_capital": "Tunis",
    "country_population": 11818618,
    "country_continent": "Africa",
    "country_language": "Arabic",
    "country_currency": "Tunisian dinar (د.ت)",
    "country_flag": "https://flagcdn.com/tn.svg"
  },
  {
    "country_name": "Italy",
    "country_description": "Italy, officially the Italian Republic, is a country in Southern and Western Europe. It consists of a peninsula that extends into the Mediterranean Sea, with the Alps on its northern land border, as well as nearly 800 islands, notably Sicily and Sardinia. Italy shares its borders with France, Switzerland, Austria, Slovenia, and two enclaves: Vatican City and San Marino. It is the tenth-largest country in Europe by area, covering 301,340 km2 (116,350 sq mi), and the third-most populous member state of the European Union, with a population of nearly 60 million. Italy's capital and largest city is Rome; other major urban areas include Milan, Naples, Turin, Palermo, Bologna, Florence, Genoa, and Venice.",
    "country_capital": "Rome",
    "country_population": 59554023,
    "country_continent": "Europe",
    "country_language": "Italian",
    "country_currency": "Euro (€)",
    "country_flag": "https://flagcdn.com/it.svg"
  },
  {
    "country_name": "Benin",
    "country_description": "Benin, officially the Republic of Benin, is a country in West Africa. It was formerly known as Dahomey. It is bordered by Togo to the west, Nigeria to the east, Burkina Faso to the north-west, and Niger to the north-east. The majority of its population lives on the southern coastline of the Bight of Benin, part of the Gulf of Guinea in the northernmost tropical portion of the Atlantic Ocean. The capital is Porto-Novo, and the seat of government is in Cotonou, the most populous city and economic capital. Benin covers an area of 112,622 km2 (43,484 sq mi), and its population in 2021 was estimated to be approximately 13 million. It is a tropical country with an economy heavily dependent on agriculture, and is an exporter of palm oil and cotton.",
    "country_capital": "Porto-Novo",
    "country_population": 12123198,
    "country_continent": "Africa",
    "country_language": "French",
    "country_currency": "West African CFA franc (Fr)",
    "country_flag": "https://flagcdn.com/bj.svg"
  },
  {
    "country_name": "Indonesia",
    "country_description": "Indonesia, officially the Republic of Indonesia, is a country in Southeast Asia and Oceania, between the Indian and Pacific oceans. Indonesia consists of over 17,000 islands, including Sumatra, Java, Sulawesi, and various parts of Borneo and New Guinea. Indonesia is the world's largest archipelagic state and the 14th-largest country by area, at 1,904,569 square kilometres. With a population over 280 million people, Indonesia is the world's fourth-most-populous country and the most populous Muslim-majority country. Java, the world's most populous island, is home to more than half of the country's entire population.",
    "country_capital": "Jakarta",
    "country_population": 273523621,
    "country_continent": "Asia",
    "country_language": "Indonesian",
    "country_currency": "Indonesian rupiah (Rp)",
    "country_flag": "https://flagcdn.com/id.svg"
  },
  {
    "country_name": "Cape Verde",
    "country_description": "Cape Verde or Cabo Verde, officially the Republic of Cabo Verde, is an island country and archipelagic state of West Africa in the central Atlantic Ocean, consisting of ten volcanic islands with a combined land area of about 4,033 square kilometres (1,557 sq mi). These islands lie between 600 and 850 kilometres west of Cap-Vert, the westernmost point of continental Africa. The Cape Verde islands form part of the Macaronesia ecoregion, along with the Azores, the Canary Islands, Madeira and the Savage Isles.",
    "country_capital": "Praia",
    "country_population": 555988,
    "country_continent": "Africa",
    "country_language": "Portuguese",
    "country_currency": "Cape Verdean escudo (Esc)",
    "country_flag": "https://flagcdn.com/cv.svg"
  },
  {
    "country_name": "Saint Kitts and Nevis",
    "country_description": "Saint Kitts and Nevis, officially the Federation of Saint Christopher and Nevis, is an island country consisting of the two islands of Saint Kitts and Nevis, both located in the West Indies, in the Leeward Islands chain of the Lesser Antilles. With 261 square kilometres (101 sq mi) of territory, and roughly 48,000 inhabitants, it is the smallest sovereign state in the Western Hemisphere, in both area and population, as well as the world's smallest sovereign federation. The country is a Commonwealth realm, with Charles III as King and head of state.",
    "country_capital": "Basseterre",
    "country_population": 53192,
    "country_continent": "Americas",
    "country_language": "English",
    "country_currency": "Eastern Caribbean dollar ($)",
    "country_flag": "https://flagcdn.com/kn.svg"
  },
  {
    "country_name": "Laos",
    "country_description": "Laos, officially the Lao People's Democratic Republic (LPDR), is the only landlocked country in Southeast Asia. It is bordered by Myanmar and China to the northwest, Vietnam to the east, Cambodia to the southeast, and Thailand to the west and southwest. Its capital and most populous city is Vientiane.",
    "country_capital": "Vientiane",
    "country_population": 7275556,
    "country_continent": "Asia",
    "country_language": "Lao",
    "country_currency": "Lao kip (₭)",
    "country_flag": "https://flagcdn.com/la.svg"
  },
  {
    "country_name": "Caribbean Netherlands",
    "country_description": "The Caribbean Netherlands is a geographic region of the Netherlands located outside of Europe, in the Caribbean, consisting of three special municipalities. These are the islands of Bonaire, Sint Eustatius, and Saba, as they are also known in legislation, or the BES islands for short. The islands are officially classified as public bodies in the Netherlands and as overseas territories of the European Union; as such, European Union law does not automatically apply to them.",
    "country_capital": "Kralendijk",
    "country_population": 25987,
    "country_continent": "Americas",
    "country_language": "English",
    "country_currency": "United States dollar ($)",
    "country_flag": "https://flagcdn.com/bq.svg"
  },
  {
    "country_name": "Uganda",
    "country_description": "Uganda, officially the Republic of Uganda, is a landlocked country in East Africa. It is bordered to the east by Kenya, to the north by South Sudan, to the west by the Democratic Republic of the Congo, to the south-west by Rwanda, and to the south by Tanzania. The southern part includes a substantial portion of Lake Victoria, shared with Kenya and Tanzania. Uganda is in the African Great Lakes region, it lies within the Nile basin, and has a varied equatorial climate. As of 2024, it has a population of over 49 million, of which 8.5 million live in the capital and largest city, Kampala.",
    "country_capital": "Kampala",
    "country_population": 45741000,
    "country_continent": "Africa",
    "country_language": "English",
    "country_currency": "Ugandan shilling (Sh)",
    "country_flag": "https://flagcdn.com/ug.svg"
  },
  {
    "country_name": "Andorra",
    "country_description": "Andorra, officially the Principality of Andorra, is a sovereign landlocked country on the Iberian Peninsula, in the eastern Pyrenees in Western Europe, bordered by France to the north and Spain to the south. Believed to have been created by Charlemagne, Andorra was ruled by the count of Urgell until 988, when it was transferred to the Roman Catholic Diocese of Urgell. The present principality was formed by a charter in 1278. It is currently headed by two co-princes: the Bishop of Urgell in Catalonia, Spain, and the president of France. Its capital and largest city is Andorra la Vella.",
    "country_capital": "Andorra la Vella",
    "country_population": 77265,
    "country_continent": "Europe",
    "country_language": "Catalan",
    "country_currency": "Euro (€)",
    "country_flag": "https://flagcdn.com/ad.svg"
  },
  {
    "country_name": "Burundi",
    "country_description": "Burundi, officially the Republic of Burundi, is a landlocked country in the Great Rift Valley at the junction between the African Great Lakes region and Southeast Africa, with population of over 14 million people. It is bordered by Rwanda to the north, Tanzania to the east and southeast, and the Democratic Republic of the Congo to the west; Lake Tanganyika lies along its southwestern border. The capital city is Gitega and the largest city is Bujumbura.",
    "country_capital": "Gitega",
    "country_population": 11890781,
    "country_continent": "Africa",
    "country_language": "French",
    "country_currency": "Burundian franc (Fr)",
    "country_flag": "https://flagcdn.com/bi.svg"
  },
  {
    "country_name": "South Africa",
    "country_description": "South Africa, officially the Republic of South Africa (RSA), is the southernmost country in Africa. Its nine provinces are bounded to the south by 2,798 kilometres of coastline that stretches along the South Atlantic and Indian Ocean; to the north by the neighbouring countries of Namibia, Botswana, and Zimbabwe; to the east and northeast by Mozambique and Eswatini; and it encloses Lesotho. Covering an area of 1,221,037 square kilometres, the country has over 62 million people. Pretoria is the administrative capital, while Cape Town, as the seat of Parliament, is the legislative capital. Bloemfontein has traditionally been regarded as the judicial capital. The largest and most populous city is Johannesburg, followed by Cape Town and the busiest port city in sub-Saharan Africa, Durban.",
    "country_capital": "Pretoria",
    "country_population": 59308690,
    "country_continent": "Africa",
    "country_language": "Afrikaans",
    "country_currency": "South African rand (R)",
    "country_flag": "https://flagcdn.com/za.svg"
  },
  {
    "country_name": "France",
    "country_description": "France, officially the French Republic, is a country located primarily in Western Europe. Its overseas regions and territories include French Guiana in South America, Saint Pierre and Miquelon in the North Atlantic, the French West Indies, and many islands in Oceania and the Indian Ocean, giving it one of the largest discontiguous exclusive economic zones in the world. Metropolitan France shares borders with Belgium and Luxembourg to the north, Germany to the northeast, Switzerland to the east, Italy and Monaco to the southeast, Andorra and Spain to the south, and a maritime border with the United Kingdom to the northwest. Its metropolitan area extends from the Rhine to the Atlantic Ocean and from the Mediterranean Sea to the English Channel and the North Sea. Its eighteen integral regions—five of which are overseas—span a combined area of 643,801 km2 (248,573 sq mi) and have a total population of nearly 68.4 million as of January 2024. France is a semi-presidential republic with its capital in Paris, the country's largest city and main cultural and commercial centre.",
    "country_capital": "Paris",
    "country_population": 67391582,
    "country_continent": "Europe",
    "country_language": "French",
    "country_currency": "Euro (€)",
    "country_flag": "https://flagcdn.com/fr.svg"
  },
  {
    "country_name": "Libya",
    "country_description": "Libya, officially the State of Libya, is a country in the Maghreb region of North Africa. It borders the Mediterranean Sea to the north, Egypt to the east, Sudan to the southeast, Chad to the south, Niger to the southwest, Algeria to the west, and Tunisia to the northwest, as well as maritime borders with Greece, Italy and Malta to the north. Libya comprises three historical regions: Tripolitania, Fezzan, and Cyrenaica. With an area of almost 1.8 million km2 (700,000 sq mi), it is the fourth-largest country in Africa and the Arab world, and the 16th-largest in the world. Libya claims 32,000 square kilometres of southeastern Algeria, south of the Libyan town of Ghat. The country's official religion is Islam, with 96.6% of the Libyan population being Sunni Muslims. The official language of Libya is Arabic, with vernacular Libyan Arabic being spoken most widely. The majority of Libya's population is Arab. The largest city and capital, Tripoli, is located in northwestern Libya and contains over a million of Libya's seven million people.",
    "country_capital": "Tripoli",
    "country_population": 6871287,
    "country_continent": "Africa",
    "country_language": "Arabic",
    "country_currency": "Libyan dinar (ل.د)",
    "country_flag": "https://flagcdn.com/ly.svg"
  },
  {
    "country_name": "Mexico",
    "country_description": "Mexico, officially the United Mexican States, is a country in the southern portion of North America. Covering 1,972,550 km2, it is the world's 13th largest country by area; with a population of almost 130 million, it is the 10th most populous country and has the most Spanish speakers in the world, out of any other country. Mexico is a constitutional republic comprising 31 states and Mexico City, its capital and largest city, which is among the world's most populous metropolitan areas. The country borders the United States to the north; as well as Guatemala and Belize to the southeast. It has maritime borders with the Pacific Ocean to the west, the Caribbean Sea to the southeast, and the Gulf of Mexico to the east.",
    "country_capital": "Mexico City",
    "country_population": 128932753,
    "country_continent": "Americas",
    "country_language": "Spanish",
    "country_currency": "Mexican peso ($)",
    "country_flag": "https://flagcdn.com/mx.svg"
  },
  {
    "country_name": "Gabon",
    "country_description": "Gabon, officially the Gabonese Republic, is a country on the Atlantic coast of Central Africa, on the equator, bordered by Equatorial Guinea to the northwest, Cameroon to the north, the Republic of the Congo on the east and south, and the Gulf of Guinea to the west. It has an area of 270,000 square kilometres (100,000 sq mi) and a population of 2.3 million people. There are coastal plains, mountains, and a savanna in the east. Libreville is the country's capital and largest city.",
    "country_capital": "Libreville",
    "country_population": 2225728,
    "country_continent": "Africa",
    "country_language": "French",
    "country_currency": "Central African CFA franc (Fr)",
    "country_flag": "https://flagcdn.com/ga.svg"
  },
  {
    "country_name": "Northern Mariana Islands",
    "country_description": "The Northern Mariana Islands, officially the Commonwealth of the Northern Mariana Islands (CNMI), is an unincorporated territory and commonwealth of the United States consisting of 14 islands in the northwestern Pacific Ocean. The CNMI includes the 14 northernmost islands in the Mariana Archipelago; the southernmost island, Guam is a U.S. territory. The Northern Mariana Islands were listed by the United Nations as a non-self-governing territory until 1990.",
    "country_capital": "Saipan",
    "country_population": 57557,
    "country_continent": "Oceania",
    "country_language": "Carolinian",
    "country_currency": "United States dollar ($)",
    "country_flag": "https://flagcdn.com/mp.svg"
  },
  {
    "country_name": "North Macedonia",
    "country_description": "North Macedonia, officially the Republic of North Macedonia, is a landlocked country in Southeast Europe. It shares land borders with Greece to the south, Albania to the west, Bulgaria to the east, Kosovo to the northwest and Serbia to the north. It constitutes approximately the northern third of the larger geographical region of Macedonia. Skopje, the capital and largest city, is home to a quarter of the country's population of 1.83 million. The majority of the residents are ethnic Macedonians, a South Slavic people. Albanians form a significant minority at around 25%, followed by Turks, Roma, Serbs, Bosniaks, Aromanians and a few other minorities.",
    "country_capital": "Skopje",
    "country_population": 2077132,
    "country_continent": "Europe",
    "country_language": "Macedonian",
    "country_currency": "denar (den)",
    "country_flag": "https://flagcdn.com/mk.svg"
  },
  {
    "country_name": "China",
    "country_description": "China, officially the People's Republic of China (PRC), is a country in East Asia. With a population exceeding 1.4 billion, it is the second-most populous country after India, representing 17.4% of the world population. China spans the equivalent of five time zones and borders fourteen countries by land. With an area of nearly 9.6 million square kilometers (3,700,000 sq mi), it is the third-largest country by total land area. The country is divided into 33 province-level divisions: 22 provinces, five autonomous regions, four municipalities, and two semi-autonomous special administrative regions. Beijing is the country's capital, while Shanghai is its most populous city by urban area and largest financial center.",
    "country_capital": "Beijing",
    "country_population": 1402112000,
    "country_continent": "Asia",
    "country_language": "Chinese",
    "country_currency": "Chinese yuan (¥)",
    "country_flag": "https://flagcdn.com/cn.svg"
  },
  {
    "country_name": "Yemen",
    "country_description": "Yemen, officially the Republic of Yemen, is a country in West Asia. Located in southern Arabia, it borders Saudi Arabia to the north, Oman to the northeast, the Red Sea to the west, and the Indian Ocean to the south, sharing maritime borders with Eritrea, Djibouti and Somalia across the Horn of Africa. Covering roughly 455,000 square kilometres, with a coastline of approximately 2,000 kilometres, Yemen is the second largest country on the Arabian Peninsula. Sanaa is its constitutional capital and largest city. Yemen's estimated population is 34.7 million, mostly Arab Muslims. It is a member of the Arab League, the United Nations, the Non-Aligned Movement and the Organisation of Islamic Cooperation.",
    "country_capital": "Sana'a",
    "country_population": 29825968,
    "country_continent": "Asia",
    "country_language": "Arabic",
    "country_currency": "Yemeni rial (﷼)",
    "country_flag": "https://flagcdn.com/ye.svg"
  },
  {
    "country_name": "Saint Barthélemy",
    "country_description": "Saint Barthélemy, officially the Collectivité territoriale de Saint-Barthélemy, also known as St. Barts (English) or St. Barth (French), is an overseas collectivity of France in the Caribbean. The island lies about 30 kilometres (19 mi) southeast of the island of Saint Martin; it is northeast of the Dutch islands of Saba and Sint Eustatius, as well as north of the independent country of Saint Kitts and Nevis.",
    "country_capital": "Gustavia",
    "country_population": 4255,
    "country_continent": "Americas",
    "country_language": "French",
    "country_currency": "Euro (€)",
    "country_flag": "https://flagcdn.com/bl.svg"
  },
  {
    "country_name": "Guernsey",
    "country_description": "Guernsey is the second-largest island in the Channel Islands, located 27 miles (43 km) west of the Cotentin Peninsula, Normandy. It is the largest island in the Bailiwick of Guernsey, which includes five other inhabited islands – Alderney, Herm, Jethou, Lihou and Sark – and many small islets and rocks. The bailiwick has a population of 63,950, the vast majority of whom live on Guernsey, and the island has a land area of 24 square miles (62 km2).",
    "country_capital": "St. Peter Port",
    "country_population": 62999,
    "country_continent": "Europe",
    "country_language": "English",
    "country_currency": "British pound (£)",
    "country_flag": "https://flagcdn.com/gg.svg"
  },
  {
    "country_name": "Solomon Islands",
    "country_description": "Solomon Islands, also known simply as the Solomons, is an island country consisting of six major islands and over 900 smaller islands in Melanesia, part of Oceania, to the northeast of Australia. It is directly adjacent to Papua New Guinea to the west, Australia to the southwest, New Caledonia and Vanuatu to the southeast, Fiji, Wallis and Futuna, and Tuvalu to the east, and Nauru and the Federated States of Micronesia to the north. It has a total area of 28,896 square kilometres, and a population of 734,887 according to the official estimates for mid 2023. Its capital and largest city, Honiara, is located on the largest island, Guadalcanal. The country takes its name from the wider area of the Solomon Islands archipelago, which is a collection of Melanesian islands that also includes the Autonomous Region of Bougainville, but excludes the Santa Cruz Islands.",
    "country_capital": "Honiara",
    "country_population": 686878,
    "country_continent": "Oceania",
    "country_language": "English",
    "country_currency": "Solomon Islands dollar ($)",
    "country_flag": "https://flagcdn.com/sb.svg"
  },
  {
    "country_name": "Svalbard and Jan Mayen",
    "country_description": "Svalbard and Jan Mayen is a statistical designation defined by ISO 3166-1 for a collective grouping of two remote jurisdictions of Norway: Svalbard and Jan Mayen. While the two are combined for the purposes of the International Organization for Standardization (ISO) category, they are not administratively related. This has further resulted in the country code top-level domain .sj being issued for Svalbard and Jan Mayen, and ISO 3166-2:SJ. The United Nations Statistics Division also uses this code, but has named it the Svalbard and Jan Mayen Islands.",
    "country_capital": "Longyearbyen",
    "country_population": 2562,
    "country_continent": "Europe",
    "country_language": "Norwegian",
    "country_currency": "krone (kr)",
    "country_flag": "https://flagcdn.com/sj.svg"
  },
  {
    "country_name": "Faroe Islands",
    "country_description": "The Faroe or Faeroe Islands, or simply the Faroes, are an archipelago in the North Atlantic Ocean and an autonomous territory of the Kingdom of Denmark. The official language of the country is Faroese, which is closely related to and partially mutually intelligible with Icelandic.",
    "country_capital": "Tórshavn",
    "country_population": 48865,
    "country_continent": "Europe",
    "country_language": "Danish",
    "country_currency": "Danish krone (kr)",
    "country_flag": "https://flagcdn.com/fo.svg"
  },
  {
    "country_name": "Uzbekistan",
    "country_description": "Uzbekistan, officially the Republic of Uzbekistan, is a doubly landlocked country located in Central Asia. It is surrounded by five countries: Kazakhstan to the north, Kyrgyzstan to the northeast, Tajikistan to the southeast, Afghanistan to the south, and Turkmenistan to the southwest, making it one of only two doubly landlocked countries on Earth, the other being Liechtenstein. Uzbekistan is part of the Turkic world, as well as a member of the Organization of Turkic States. Uzbek, spoken by the Uzbek people, is the official language and spoken by the majority of its inhabitants, while Russian and Tajik are significant minority languages. Islam is the predominant religion, and most Uzbeks are Sunni Muslims.",
    "country_capital": "Tashkent",
    "country_population": 34232050,
    "country_continent": "Asia",
    "country_language": "Russian",
    "country_currency": "Uzbekistani soʻm (so'm)",
    "country_flag": "https://flagcdn.com/uz.svg"
  },
  {
    "country_name": "Egypt",
    "country_description": "Egypt, officially the Arab Republic of Egypt, is a country spanning the northeast corner of Africa and the Sinai Peninsula in the southwest corner of Asia. It is bordered by the Mediterranean Sea to the north, the Gaza Strip of Palestine and Israel to the northeast, the Red Sea to the east, Sudan to the south, and Libya to the west. The Gulf of Aqaba in the northeast separates Egypt from Jordan and Saudi Arabia. Cairo is the capital and largest city of Egypt, while Alexandria, the second-largest city, is an important industrial and tourist hub at the Mediterranean coast. At approximately 110 million inhabitants, Egypt is the 14th-most populated country in the world, and the third-most populated in Africa.",
    "country_capital": "Cairo",
    "country_population": 102334403,
    "country_continent": "Africa",
    "country_language": "Arabic",
    "country_currency": "Egyptian pound (£)",
    "country_flag": "https://flagcdn.com/eg.svg"
  },
  {
    "country_name": "Senegal",
    "country_description": "Senegal, officially the Republic of Senegal, is the westernmost country in West Africa, situated on the Atlantic Ocean coastline. It borders Mauritania to the north, Mali to the east, Guinea to the southeast and Guinea-Bissau to the southwest. Senegal nearly surrounds The Gambia, a country occupying a narrow sliver of land along the banks of the Gambia River, which separates Senegal's southern region of Casamance from the rest of the country. It also shares a maritime border with Cape Verde. Senegal's economic and political capital is Dakar.",
    "country_capital": "Dakar",
    "country_population": 16743930,
    "country_continent": "Africa",
    "country_language": "French",
    "country_currency": "West African CFA franc (Fr)",
    "country_flag": "https://flagcdn.com/sn.svg"
  },
  {
    "country_name": "Sri Lanka",
    "country_description": "Sri Lanka, historically known as Ceylon, and officially the Democratic Socialist Republic of Sri Lanka, is an island country in South Asia. It lies in the Indian Ocean, southwest of the Bay of Bengal, separated from the Indian peninsula by the Gulf of Mannar and the Palk Strait. It shares a maritime border with the Maldives in the southwest and India in the northwest.",
    "country_capital": "Sri Jayawardenepura Kotte",
    "country_population": 21919000,
    "country_continent": "Asia",
    "country_language": "Sinhala",
    "country_currency": "Sri Lankan rupee (Rs  රු)",
    "country_flag": "https://flagcdn.com/lk.svg"
  },
  {
    "country_name": "Palestine",
    "country_description": "Palestine, officially the State of Palestine, is a country in the southern Levant region of West Asia recognized by 146 out of 193 UN member states. It encompasses the Israeli-occupied West Bank, including East Jerusalem, and the Gaza Strip, collectively known as the occupied Palestinian territories, within the broader geographic and historical Palestine region. Palestine shares most of its borders with Israel, and it borders Jordan to the east and Egypt to the southwest. It has a total land area of 6,020 square kilometres (2,320 sq mi) while its population exceeds five million people. Its proclaimed capital is Jerusalem, while Ramallah serves as its administrative center. Gaza City was its largest city prior to evacuations in 2023.",
    "country_capital": "Ramallah",
    "country_population": 4803269,
    "country_continent": "Asia",
    "country_language": "Arabic",
    "country_currency": "Egyptian pound (E£)",
    "country_flag": "https://flagcdn.com/ps.svg"
  },
  {
    "country_name": "Bangladesh",
    "country_description": "Bangladesh, officially the People's Republic of Bangladesh, is a country in South Asia. It is the eighth-most populous country in the world and seventh most densely populated with a population of 173,562,364 in an area of 148,460 square kilometres (57,320 sq mi). Bangladesh shares land borders with India to the north, west, and east, and Myanmar to the southeast. To the south, it has a coastline along the Bay of Bengal. To the north, it is separated from Bhutan and Nepal by the Siliguri Corridor, and from China by the mountainous Indian state of Sikkim. Dhaka, the capital and largest city, is the nation's political, financial, and cultural centre. Chittagong is the second-largest city and the busiest port. The official language is Bengali, with Bangladeshi English also used in government. Islam is the official and largest religion and Bengali Muslims form the largest ethnoreligious group in the country.",
    "country_capital": "Dhaka",
    "country_population": 164689383,
    "country_continent": "Asia",
    "country_language": "Bengali",
    "country_currency": "Bangladeshi taka (৳)",
    "country_flag": "https://flagcdn.com/bd.svg"
  },
  {
    "country_name": "Peru",
    "country_description": "Peru, officially the Republic of Peru, is a country in western South America. It is bordered in the north by Ecuador and Colombia, in the east by Brazil, in the southeast by Bolivia, in the south by Chile, and in the south and west by the Pacific Ocean. Peru is a megadiverse country, with habitats ranging from the arid plains of the Pacific coastal region in the west, to the peaks of the Andes mountains extending from the north to the southeast of the country, to the tropical Amazon basin rainforest in the east with the Amazon River. Peru has a population of over 32 million, and its capital and largest city is Lima. At 1,285,216 km2 (496,225 sq mi), Peru is the 19th largest country in the world, and the third largest in South America.",
    "country_capital": "Lima",
    "country_population": 32971846,
    "country_continent": "Americas",
    "country_language": "Aymara",
    "country_currency": "Peruvian sol (S/ )",
    "country_flag": "https://flagcdn.com/pe.svg"
  },
  {
    "country_name": "Singapore",
    "country_description": "Singapore, officially the Republic of Singapore, is an island country and city-state in Southeast Asia. The country's territory comprises one main island, 63 satellite islands and islets, and one outlying islet. It is about one degree of latitude north of the equator, off the southern tip of the Malay Peninsula, bordering the Strait of Malacca to the west, the Singapore Strait to the south along with the Riau Islands in Indonesia, the South China Sea to the east, and the Straits of Johor along with the State of Johor in Malaysia to the north.",
    "country_capital": "Singapore",
    "country_population": 5685807,
    "country_continent": "Asia",
    "country_language": "English",
    "country_currency": "Singapore dollar ($)",
    "country_flag": "https://flagcdn.com/sg.svg"
  },
  {
    "country_name": "Turkey",
    "country_description": "Turkey, officially the Republic of Türkiye, is a country mainly located in Anatolia in West Asia, with a smaller part called East Thrace in Southeast Europe. It borders the Black Sea to the north; Georgia, Armenia, Azerbaijan, and Iran to the east; Iraq, Syria, and the Mediterranean Sea to the south; and the Aegean Sea, Greece, and Bulgaria to the west. Turkey is home to over 85 million people; most are ethnic Turks, while ethnic Kurds are the largest ethnic minority. Officially a secular state, Turkey has a Muslim-majority population. Ankara is Turkey's capital and second-largest city, while Istanbul is its largest city and economic and financial center. Other major cities include İzmir, Bursa, and Antalya.",
    "country_capital": "Ankara",
    "country_population": 84339067,
    "country_continent": "Asia",
    "country_language": "Turkish",
    "country_currency": "Turkish lira (₺)",
    "country_flag": "https://flagcdn.com/tr.svg"
  },
  {
    "country_name": "Afghanistan",
    "country_description": "Afghanistan, officially the Islamic Emirate of Afghanistan, is a landlocked country located at the crossroads of Central Asia and South Asia. It is bordered by Pakistan to the east and south, Iran to the west, Turkmenistan to the northwest, Uzbekistan to the north, Tajikistan to the northeast, and China to the northeast and east. Occupying 652,864 square kilometers (252,072 sq mi) of land, the country is predominantly mountainous with plains in the north and the southwest, which are separated by the Hindu Kush mountain range. Kabul is the country's capital and largest city. According to the World Population review, as of 2023, Afghanistan's population is 43 million.",
    "country_capital": "Kabul",
    "country_population": 40218234,
    "country_continent": "Asia",
    "country_language": "Dari",
    "country_currency": "Afghan afghani (؋)",
    "country_flag": "https://upload.wikimedia.org/wikipedia/commons/5/5c/Flag_of_the_Taliban.svg"
  },
  {
    "country_name": "Aruba",
    "country_description": "Aruba, officially the Country of Aruba, is a constituent country within the Kingdom of the Netherlands, in the southern Caribbean Sea 29 kilometres (18 mi) north of the Venezuelan peninsula of Paraguaná and 80 kilometres (50 mi) northwest of Curaçao. In 1986, it became a constituent country within the Kingdom of the Netherlands and acquired the formal name the Country of Aruba.",
    "country_capital": "Oranjestad",
    "country_population": 106766,
    "country_continent": "Americas",
    "country_language": "Dutch",
    "country_currency": "Aruban florin (ƒ)",
    "country_flag": "https://flagcdn.com/aw.svg"
  },
  {
    "country_name": "Cook Islands",
    "country_description": "The Cook Islands is an island country in Polynesia, part of Oceania in the South Pacific Ocean. It consists of 15 islands whose total land area is approximately 236.7 square kilometres (91 sq mi). The Cook Islands' Exclusive Economic Zone (EEZ) covers 1,960,027 square kilometres (756,771 sq mi) of ocean. Avarua is its capital.",
    "country_capital": "Avarua",
    "country_population": 18100,
    "country_continent": "Oceania",
    "country_language": "English",
    "country_currency": "Cook Islands dollar ($)",
    "country_flag": "https://flagcdn.com/ck.svg"
  },
  {
    "country_name": "United Kingdom",
    "country_description": "The United Kingdom of Great Britain and Northern Ireland, commonly known as the United Kingdom (UK) or Britain, is a country in Northwestern Europe, off the coast of the continental mainland. It comprises England, Scotland, Wales, and Northern Ireland. The UK includes the island of Great Britain, the north-eastern part of the island of Ireland, and most of the smaller islands within the British Isles, making up a total area of 94,354 square miles (244,376 km2). Northern Ireland shares a land border with the Republic of Ireland; otherwise, the United Kingdom is surrounded by the Atlantic Ocean, the North Sea, the English Channel, the Celtic Sea, and the Irish Sea. The United Kingdom had an estimated population of over 68.2 million people in 2023. The capital and largest city of both England and the United Kingdom is London, whose wider metropolitan area is the largest in Western Europe, with a population of 14.9 million. The cities of Edinburgh, Cardiff, and Belfast are the national capitals of Scotland, Wales, and Northern Ireland, respectively.",
    "country_capital": "London",
    "country_population": 67215293,
    "country_continent": "Europe",
    "country_language": "English",
    "country_currency": "British pound (£)",
    "country_flag": "https://flagcdn.com/gb.svg"
  },
  {
    "country_name": "Zambia",
    "country_description": "Zambia, officially the Republic of Zambia, is a landlocked country at the crossroads of Central, Southern and East Africa. It is typically referred to being in South-Central Africa or Southern Africa. It is bordered to the north by the Democratic Republic of the Congo, Tanzania to the north-east, Malawi to the east, Mozambique to the southeast, Zimbabwe and Botswana to the south, Namibia to the southwest, and Angola to the west. The capital city of Zambia is Lusaka, located in the south-central part of Zambia. The population is concentrated mainly around Lusaka in the south and the Copperbelt Province to the north, the core economic hubs of the country.",
    "country_capital": "Lusaka",
    "country_population": 18383956,
    "country_continent": "Africa",
    "country_language": "English",
    "country_currency": "Zambian kwacha (ZK)",
    "country_flag": "https://flagcdn.com/zm.svg"
  },
  {
    "country_name": "Finland",
    "country_description": "Finland, officially the Republic of Finland, is a Nordic country in Northern Europe. It borders Sweden to the northwest, Norway to the north, and Russia to the east, with the Gulf of Bothnia to the west and the Gulf of Finland to the south, opposite Estonia. Finland covers a total area of 338,145 square kilometres (130,559 sq mi), including a land area of 303,815 square kilometres (117,304 sq mi), and has a population of 5.6 million. Helsinki is the capital and largest city. The vast majority of the population are ethnic Finns. The official languages are Finnish and Swedish; 84.9 percent of the population speak the first as their mother tongue and 5.1 percent the latter. Finland's climate varies from humid continental in the south to boreal in the north. The land cover is predominantly boreal forest biome, with more than 180,000 recorded lakes.",
    "country_capital": "Helsinki",
    "country_population": 5530719,
    "country_continent": "Europe",
    "country_language": "Finnish",
    "country_currency": "Euro (€)",
    "country_flag": "https://flagcdn.com/fi.svg"
  },
  {
    "country_name": "Niger",
    "country_description": "Niger, officially the Republic of the Niger, is a landlocked country in West Africa. It is a unitary state bordered by Libya to the northeast, Chad to the east, Nigeria to the south, Benin and Burkina Faso to the southwest, Mali to the west, and Algeria to the northwest. It covers a land area of almost 1,270,000 km2 (490,000 sq mi), making it the largest landlocked country in West Africa and the second largest landlocked nation in Africa behind Chad. Over 80% of its land area lies in the Sahara. Its predominantly Muslim population of about 25 million lives mostly in clusters in the south and west of the country. The capital Niamey is located in Niger's southwest corner along the namesake Niger River.",
    "country_capital": "Niamey",
    "country_population": 24206636,
    "country_continent": "Africa",
    "country_language": "French",
    "country_currency": "West African CFA franc (Fr)",
    "country_flag": "https://flagcdn.com/ne.svg"
  },
  {
    "country_name": "Christmas Island",
    "country_description": "The Territory of Christmas Island is an Australian external territory in the Indian Ocean comprising the island of the same name. It is located approximately 350 kilometres south of Java and Sumatra and about 1,550 km (840 nmi) north-west of the closest point on the Australian mainland. With an area of 135 square kilometres (52 sq mi), Christmas Island's geographic isolation and history of minimal human disturbance has led to a high level of endemism among its flora and fauna, which is of interest to scientists and naturalists. The territory derives its name from its discovery on Christmas Day 1643 by Captain William Mynors.",
    "country_capital": "Flying Fish Cove",
    "country_population": 2072,
    "country_continent": "Oceania",
    "country_language": "English",
    "country_currency": "Australian dollar ($)",
    "country_flag": "https://flagcdn.com/cx.svg"
  },
  {
    "country_name": "Tokelau",
    "country_description": "Tokelau is a dependent territory of New Zealand in the southern Pacific Ocean. It consists of three tropical coral atolls: Atafu, Nukunonu, and Fakaofo. They have a combined land area of 10 km2 (4 sq mi). In addition to these three, Swains Island, which forms part of the same archipelago, is the subject of an ongoing territorial dispute; it is currently administered by the United States as part of American Samoa. Tokelau lies north of the Samoan Islands, east of Tuvalu, south of the Phoenix Islands, southwest of the more distant Line Islands, and northwest of the Cook Islands.",
    "country_capital": "Fakaofo",
    "country_population": 1411,
    "country_continent": "Oceania",
    "country_language": "English",
    "country_currency": "New Zealand dollar ($)",
    "country_flag": "https://flagcdn.com/tk.svg"
  },
  {
    "country_name": "Guinea-Bissau",
    "country_description": "Guinea-Bissau, officially the Republic of Guinea-Bissau, is a country in West Africa that covers 36,125 square kilometres (13,948 sq mi) with an estimated population of 2,026,778. It borders Senegal to its north and Guinea to its southeast.",
    "country_capital": "Bissau",
    "country_population": 1967998,
    "country_continent": "Africa",
    "country_language": "Portuguese",
    "country_currency": "West African CFA franc (Fr)",
    "country_flag": "https://flagcdn.com/gw.svg"
  },
  {
    "country_name": "Azerbaijan",
    "country_description": "Azerbaijan, officially the Republic of Azerbaijan, is a transcontinental and landlocked country at the boundary of Eastern Europe and West Asia. It is a part of the South Caucasus region and is bounded by the Caspian Sea to the east, Russia's republic of Dagestan to the north, Georgia to the northwest, Armenia and Turkey to the west, and Iran to the south. Baku is the capital and largest city.",
    "country_capital": "Baku",
    "country_population": 10110116,
    "country_continent": "Asia",
    "country_language": "Azerbaijani",
    "country_currency": "Azerbaijani manat (₼)",
    "country_flag": "https://flagcdn.com/az.svg"
  },
  {
    "country_name": "Réunion",
    "country_description": "La Réunion is an island in the Indian Ocean that is an overseas department and region of France. Part of the Mascarene Islands, it is located approximately 679 km (422 mi) east of the island of Madagascar and 175 km (109 mi) southwest of the island of Mauritius. As of January 2024, it had a population of 885,700. Its capital and largest city is Saint-Denis.",
    "country_capital": "Saint-Denis",
    "country_population": 840974,
    "country_continent": "Africa",
    "country_language": "French",
    "country_currency": "Euro (€)",
    "country_flag": "https://flagcdn.com/re.svg"
  },
  {
    "country_name": "Djibouti",
    "country_description": "Djibouti, officially the Republic of Djibouti, is a country in the Horn of Africa, bordered by Somalia to the south, Ethiopia to the southwest, Eritrea in the north, and the Red Sea and the Gulf of Aden to the east. The country has an area of 23,200 km2 (8,958 sq mi).",
    "country_capital": "Djibouti",
    "country_population": 988002,
    "country_continent": "Africa",
    "country_language": "Arabic",
    "country_currency": "Djiboutian franc (Fr)",
    "country_flag": "https://flagcdn.com/dj.svg"
  },
  {
    "country_name": "North Korea",
    "country_description": "North Korea, officially the Democratic People's Republic of Korea (DPRK), is a country in East Asia. It constitutes the northern half of the Korean Peninsula and borders China and Russia to the north at the Yalu (Amnok) and Tumen rivers, and South Korea to the south at the Korean Demilitarized Zone. The country's western border is formed by the Yellow Sea, while its eastern border is defined by the Sea of Japan. North Korea, like its southern counterpart, claims to be the sole legitimate government of the entire peninsula and adjacent islands. Pyongyang is the capital and largest city.",
    "country_capital": "Pyongyang",
    "country_population": 25778815,
    "country_continent": "Asia",
    "country_language": "Korean",
    "country_currency": "North Korean won (₩)",
    "country_flag": "https://flagcdn.com/kp.svg"
  },
  {
    "country_name": "Mauritius",
    "country_description": "Mauritius, officially the Republic of Mauritius, is an island country in the Indian Ocean, about 2,000 kilometres off the southeastern coast of East Africa, east of Madagascar. It includes the main island, as well as Rodrigues, Agaléga, and St. Brandon. The islands of Mauritius and Rodrigues, along with nearby Réunion, are part of the Mascarene Islands. The main island of Mauritius, where the population is concentrated, hosts the capital and largest city, Port Louis. The country spans 2,040 square kilometres (790 sq mi) and has an exclusive economic zone covering 2,300,000 square kilometres.",
    "country_capital": "Port Louis",
    "country_population": 1265740,
    "country_continent": "Africa",
    "country_language": "English",
    "country_currency": "Mauritian rupee (₨)",
    "country_flag": "https://flagcdn.com/mu.svg"
  },
  {
    "country_name": "Montserrat",
    "country_description": "Montserrat is a British Overseas Territory in the Caribbean. It is part of the Leeward Islands, the northern portion of the Lesser Antilles chain of the West Indies. Montserrat is about 16 km (10 mi) long and 11 km (7 mi) wide, with roughly 40 km (25 mi) of coastline. It is nicknamed \"The Emerald Isle of the Caribbean\" both for its resemblance to coastal Ireland and for the Irish ancestry of many of its inhabitants. Montserrat is the only non-fully sovereign full member of the Caribbean Community and the Organisation of Eastern Caribbean States, though it is far from being the only dependency in the Caribbean overall.",
    "country_capital": "Plymouth",
    "country_population": 4922,
    "country_continent": "Americas",
    "country_language": "English",
    "country_currency": "Eastern Caribbean dollar ($)",
    "country_flag": "https://flagcdn.com/ms.svg"
  },
  {
    "country_name": "United States Virgin Islands",
    "country_description": "The United States Virgin Islands, officially the Virgin Islands of the United States, are a group of Caribbean islands and a territory of the United States. The islands are geographically part of the Virgin Islands archipelago and are located in the Leeward Islands of the Lesser Antilles. The islands have a tropical climate.",
    "country_capital": "Charlotte Amalie",
    "country_population": 106290,
    "country_continent": "Americas",
    "country_language": "English",
    "country_currency": "United States dollar ($)",
    "country_flag": "https://flagcdn.com/vi.svg"
  },
  {
    "country_name": "Colombia",
    "country_description": "Colombia, officially the Republic of Colombia, is a country primarily located in South America with insular regions in North America. The Colombian mainland is bordered by the Caribbean Sea to the north, Venezuela to the east and northeast, Brazil to the southeast, Ecuador and Peru to the south and southwest, the Pacific Ocean to the west, and Panama to the northwest. Colombia is divided into 32 departments. The Capital District of Bogotá is also the country's largest city hosting the main financial and cultural hub. Other major urban areas include Medellín, Cali, Barranquilla, Cartagena, Santa Marta, Cúcuta, Ibagué, Villavicencio and Bucaramanga. It covers an area of 1,141,748 square kilometers and has a population of around 52 million. Its rich cultural heritage—including language, religion, cuisine, and art—reflects its history as a colony, fusing cultural elements brought by immigration from Europe and the Middle East, with those brought by the African diaspora, as well as with those of the various Indigenous civilizations that predate colonization. Spanish is the official language, although Creole, English and 64 other languages are recognized regionally.",
    "country_capital": "Bogotá",
    "country_population": 50882884,
    "country_continent": "Americas",
    "country_language": "Spanish",
    "country_currency": "Colombian peso ($)",
    "country_flag": "https://flagcdn.com/co.svg"
  },
  {
    "country_name": "Greece",
    "country_description": "Greece, officially the Hellenic Republic, is a country in Southeast Europe. Located on the southern tip of the Balkan peninsula, Greece shares land borders with Albania to the northwest, North Macedonia and Bulgaria to the north, and Turkey to the east. The Aegean Sea lies to the east of the mainland, the Ionian Sea to the west, and the Sea of Crete and the Mediterranean Sea to the south. Greece has the longest coastline on the Mediterranean Basin, featuring thousands of islands. The country comprises nine traditional geographic regions, and has a population of over 10.4 million. Athens is the nation's capital and largest city, followed by Thessaloniki and Patras.",
    "country_capital": "Athens",
    "country_population": 10715549,
    "country_continent": "Europe",
    "country_language": "Greek",
    "country_currency": "Euro (€)",
    "country_flag": "https://flagcdn.com/gr.svg"
  },
  {
    "country_name": "Croatia",
    "country_description": "Croatia, officially the Republic of Croatia, is a country in Central and Southeast Europe, on the coast of the Adriatic Sea. It borders Slovenia to the northwest, Hungary to the northeast, Serbia to the east, Bosnia and Herzegovina and Montenegro to the southeast, and shares a maritime border with Italy to the west. Its capital and largest city, Zagreb, forms one of the country's primary subdivisions, with twenty counties. Other major urban centers include Split, Rijeka and Osijek. The country spans 56,594 square kilometres, and has a population of nearly 3.9 million.",
    "country_capital": "Zagreb",
    "country_population": 4047200,
    "country_continent": "Europe",
    "country_language": "Croatian",
    "country_currency": "Euro (€)",
    "country_flag": "https://flagcdn.com/hr.svg"
  },
  {
    "country_name": "Morocco",
    "country_description": "Morocco, officially the Kingdom of Morocco, is a country in the Maghreb region of North Africa. It overlooks the Mediterranean Sea to the north and the Atlantic Ocean to the west, and has land borders with Algeria to the east, and the disputed territory of Western Sahara to the south. Morocco also claims the Spanish exclaves of Ceuta, Melilla and Peñón de Vélez de la Gomera, and several small Spanish-controlled islands off its coast. It has a population of approximately 37 million. Islam is both the official and predominant religion, while Arabic and Berber are the official languages. Additionally, French and the Moroccan dialect of Arabic are widely spoken. The culture of Morocco is a mix of Arab, Berber, African and European cultures. Its capital is Rabat, while its largest city is Casablanca.",
    "country_capital": "Rabat",
    "country_population": 36910558,
    "country_continent": "Africa",
    "country_language": "Arabic",
    "country_currency": "Moroccan dirham (د.م.)",
    "country_flag": "https://flagcdn.com/ma.svg"
  },
  {
    "country_name": "Algeria",
    "country_description": "Algeria, officially the People's Democratic Republic of Algeria, is a country in the Maghreb region of North Africa. It is bordered to the northeast by Tunisia; to the east by Libya; to the southeast by Niger; to the southwest by Mali, Mauritania, and Western Sahara; to the west by Morocco; and to the north by the Mediterranean Sea. The capital and largest city is Algiers, located in the far north on the Mediterranean coast.",
    "country_capital": "Algiers",
    "country_population": 44700000,
    "country_continent": "Africa",
    "country_language": "Arabic",
    "country_currency": "Algerian dinar (د.ج)",
    "country_flag": "https://flagcdn.com/dz.svg"
  },
  {
    "country_name": "Antarctica",
    "country_description": "Antarctica is Earth's southernmost and least-populated continent. Situated almost entirely south of the Antarctic Circle and surrounded by the Southern Ocean, it contains the geographic South Pole. Antarctica is the fifth-largest continent, being about 40% larger than Europe, and has an area of 14,200,000 km2 (5,500,000 sq mi). Most of Antarctica is covered by the Antarctic ice sheet, with an average thickness of 1.9 km (1.2 mi).",
    "country_population": 1000,
    "country_continent": "Antarctic",
    "country_currency": "No currency data available",
    "country_flag": "https://flagcdn.com/aq.svg"
  },
  {
    "country_name": "Netherlands",
    "country_description": "The Netherlands, informally Holland, is a country in Northwestern Europe, with overseas territories in the Caribbean. It is the largest of the four constituent countries of the Kingdom of the Netherlands. The Netherlands consists of twelve provinces; it borders Germany to the east and Belgium to the south, with a North Sea coastline to the north and west. It shares maritime borders with the United Kingdom, Germany, and Belgium. The official language is Dutch, with West Frisian as a secondary official language in the province of Friesland. Dutch, English, and Papiamento are official in the Caribbean territories.",
    "country_capital": "Amsterdam",
    "country_population": 16655799,
    "country_continent": "Europe",
    "country_language": "Dutch",
    "country_currency": "Euro (€)",
    "country_flag": "https://flagcdn.com/nl.svg"
  },
  {
    "country_name": "Sudan",
    "country_description": "Sudan, officially the Republic of the Sudan, is a country in Northeast Africa. It borders the Central African Republic to the southwest, Chad to the west, Libya to the northwest, Egypt to the north, the Red Sea to the east, Eritrea and Ethiopia to the southeast, and South Sudan to the south. Sudan has a population of 50 million people as of 2024 and occupies 1,886,068 square kilometres, making it Africa's third-largest country by area and the third-largest by area in the Arab League. It was the largest country by area in Africa and the Arab League until the secession of South Sudan in 2011; since then both titles have been held by Algeria. Sudan's capital and most populous city is Khartoum.",
    "country_capital": "Khartoum",
    "country_population": 43849269,
    "country_continent": "Africa",
    "country_language": "Arabic",
    "country_currency": "Sudanese pound (ج.س)",
    "country_flag": "https://flagcdn.com/sd.svg"
  },
  {
    "country_name": "Fiji",
    "country_description": "Fiji, officially the Republic of Fiji, is an island country in Melanesia, part of Oceania in the South Pacific Ocean. It lies about 1,100 nautical miles north-northeast of New Zealand. Fiji consists of an archipelago of more than 330 islands—of which about 110 are permanently inhabited—and more than 500 islets, amounting to a total land area of about 18,300 square kilometres (7,100 sq mi). The most outlying island group is Ono-i-Lau. About 87% of the total population live on the two major islands, Viti Levu and Vanua Levu. About three-quarters of Fijians live on Viti Levu's coasts, either in the capital city of Suva, or in smaller urban centres such as Nadi or Lautoka. The interior of Viti Levu is sparsely inhabited because of its terrain.",
    "country_capital": "Suva",
    "country_population": 896444,
    "country_continent": "Oceania",
    "country_language": "English",
    "country_currency": "Fijian dollar ($)",
    "country_flag": "https://flagcdn.com/fj.svg"
  },
  {
    "country_name": "Liechtenstein",
    "country_description": "Liechtenstein, officially the Principality of Liechtenstein, is a doubly landlocked German-speaking microstate in the Central European Alps, between Austria in the east and north and Switzerland in the west and south. Liechtenstein is a semi-constitutional monarchy headed by the prince of Liechtenstein of the House of Liechtenstein, currently led by Hans-Adam II. It is Europe's fourth-smallest country, with an area of just over 160 square kilometres and a population of 40,023. It is the world's smallest country to border two countries, and is one of the few countries with no debt.",
    "country_capital": "Vaduz",
    "country_population": 38137,
    "country_continent": "Europe",
    "country_language": "German",
    "country_currency": "Swiss franc (Fr)",
    "country_flag": "https://flagcdn.com/li.svg"
  },
  {
    "country_name": "Nepal",
    "country_description": "Nepal, officially the Federal Democratic Republic of Nepal, is a landlocked country in South Asia. It is mainly situated in the Himalayas, but also includes parts of the Indo-Gangetic Plain. It borders the Tibet Autonomous Region of China to the north, and India to the south, east, and west, while it is narrowly separated from Bangladesh by the Siliguri Corridor, and from Bhutan by the Indian state of Sikkim. Nepal has a diverse geography, including fertile plains, subalpine forested hills, and eight of the world's ten tallest mountains, including Mount Everest, the highest point on Earth. Kathmandu is the nation's capital and the largest city. Nepal is a multi-ethnic, multi-lingual, multi-religious, and multi-cultural state, with Nepali as the official language.",
    "country_capital": "Kathmandu",
    "country_population": 29136808,
    "country_continent": "Asia",
    "country_language": "Nepali",
    "country_currency": "Nepalese rupee (₨)",
    "country_flag": "https://flagcdn.com/np.svg"
  },
  {
    "country_name": "Puerto Rico",
    "country_description": "Puerto Rico, officially the Commonwealth of Puerto Rico, is a self-governing Caribbean archipelago and island organized as an unincorporated territory of the United States under the designation of commonwealth. Located about 1,000 miles (1,600 km) southeast of Miami, Florida, between the Dominican Republic in the Greater Antilles and the U.S. Virgin Islands in the Lesser Antilles, it consists of the eponymous main island and numerous smaller islands, including Vieques, Culebra, and Mona. With approximately 3.2 million residents, it is divided into 78 municipalities, of which the most populous is the capital municipality of San Juan, followed by those within the San Juan metropolitan area. Spanish and English are the official languages of the government, though Spanish predominates.",
    "country_capital": "San Juan",
    "country_population": 3194034,
    "country_continent": "Americas",
    "country_language": "English",
    "country_currency": "United States dollar ($)",
    "country_flag": "https://flagcdn.com/pr.svg"
  },
  {
    "country_name": "Georgia",
    "country_description": "Georgia most commonly refers to:Georgia (country), a country in the Caucasus region of southeastern Europe and West Asia\nGeorgia, a state in the southeastern United States",
    "country_capital": "Tbilisi",
    "country_population": 3714000,
    "country_continent": "Asia",
    "country_language": "Georgian",
    "country_currency": "lari (₾)",
    "country_flag": "https://flagcdn.com/ge.svg"
  },
  {
    "country_name": "Pakistan",
    "country_description": "Pakistan, officially the Islamic Republic of Pakistan, is a country in South Asia. It is the fifth-most populous country, with a population of over 241.5 million, having the second-largest Muslim population as of 2023. Islamabad is the nation's capital, while Karachi is its largest city and financial centre. Pakistan is the 33rd-largest country by area. Bounded by the Arabian Sea on the south, the Gulf of Oman on the southwest, and the Sir Creek on the southeast, it shares land borders with India to the east; Afghanistan to the west; Iran to the southwest; and China to the northeast. It shares a maritime border with Oman in the Gulf of Oman, and is separated from Tajikistan in the northwest by Afghanistan's narrow Wakhan Corridor.",
    "country_capital": "Islamabad",
    "country_population": 220892331,
    "country_continent": "Asia",
    "country_language": "English",
    "country_currency": "Pakistani rupee (₨)",
    "country_flag": "https://flagcdn.com/pk.svg"
  },
  {
    "country_name": "Monaco",
    "country_description": "Monaco, officially the Principality of Monaco, is a sovereign city-state and microstate on the French Riviera a few kilometres west of the Italian region of Liguria, in Western Europe, on the Mediterranean Sea. It is a semi-enclave bordered by France to the north, east and west. The principality is home to 38,682 residents, of whom 9,486 are Monégasque nationals; it is recognised as one of the wealthiest and most expensive places in the world. The official language is French; Monégasque, English and Italian are spoken and understood by many residents.",
    "country_capital": "Monaco",
    "country_population": 39244,
    "country_continent": "Europe",
    "country_language": "French",
    "country_currency": "Euro (€)",
    "country_flag": "https://flagcdn.com/mc.svg"
  },
  {
    "country_name": "Botswana",
    "country_description": "Botswana, officially the Republic of Botswana, is a landlocked country in Southern Africa. Botswana is topographically flat, with approximately 70 per cent of its territory part of the Kalahari Desert. It is bordered by South Africa to the south and southeast, Namibia to the west and north, Zambia to the north and Zimbabwe to the northeast. With a population of slightly over 2.4 million people and a comparable land area to France, Botswana is one of the most sparsely populated countries in the world. It is essentially the nation-state of the Tswana people, who constitute nearly 80 per cent of the population.",
    "country_capital": "Gaborone",
    "country_population": 2351625,
    "country_continent": "Africa",
    "country_language": "English",
    "country_currency": "Botswana pula (P)",
    "country_flag": "https://flagcdn.com/bw.svg"
  },
  {
    "country_name": "Lebanon",
    "country_description": "\n\nLebanon, officially the Republic of Lebanon, is a country in the Levant region of West Asia, bordered by Syria to the north and east, Israel to the south, and the Mediterranean Sea to the west; Cyprus lies a short distance from the country's coastline. It is at the crossroads of the Mediterranean Basin and the Arabian Peninsula. Lebanon has a population of more than five million and an area of 10,452 square kilometres (4,036 sq mi). Beirut is the country's capital and largest city.",
    "country_capital": "Beirut",
    "country_population": 6825442,
    "country_continent": "Asia",
    "country_language": "Arabic",
    "country_currency": "Lebanese pound (ل.ل)",
    "country_flag": "https://flagcdn.com/lb.svg"
  },
  {
    "country_name": "Papua New Guinea",
    "country_description": "Papua New Guinea is a country in Oceania that comprises the eastern half of the island of New Guinea and offshore islands in Melanesia, a region of the southwestern Pacific Ocean north of Australia. It has a land border with Indonesia to the west and neighbours Australia to the south and the Solomon Islands to the east. Its capital, on its southern coast, is Port Moresby. The country is the world's third largest island country, with an area of 462,840 km2 (178,700 sq mi).",
    "country_capital": "Port Moresby",
    "country_population": 8947027,
    "country_continent": "Oceania",
    "country_language": "English",
    "country_currency": "Papua New Guinean kina (K)",
    "country_flag": "https://flagcdn.com/pg.svg"
  },
  {
    "country_name": "Mayotte",
    "country_description": "Mayotte, officially the Department of Mayotte, is an overseas department and region and single territorial collectivity of France. It is located in the northern part of the Mozambique Channel in the Indian Ocean off the coast of Southeastern Africa, between Northwestern Madagascar and Northeastern Mozambique. Mayotte consists of a main island, Grande-Terre, a smaller island, Petite-Terre, as well as several islets around these two.",
    "country_capital": "Mamoudzou",
    "country_population": 226915,
    "country_continent": "Africa",
    "country_language": "French",
    "country_currency": "Euro (€)",
    "country_flag": "https://flagcdn.com/yt.svg"
  },
  {
    "country_name": "Dominican Republic",
    "country_description": "The Dominican Republic is a North American country located on the island of Hispaniola in the Greater Antilles of the Caribbean Sea in the North Atlantic Ocean. It shares a maritime border with Puerto Rico to the east and a land border with Haiti to the west, occupying the eastern five-eighths of Hispaniola which, along with Saint Martin, is one of only two islands in the Caribbean shared by two sovereign states. In the Antilles, the country is the second-largest nation by area after Cuba at 48,671 square kilometers (18,792 sq mi) and second-largest by population after Haiti with approximately 11.4 million people in 2024, of whom 3.6 million reside in the metropolitan area of Santo Domingo, the capital city.",
    "country_capital": "Santo Domingo",
    "country_population": 10847904,
    "country_continent": "Americas",
    "country_language": "Spanish",
    "country_currency": "Dominican peso ($)",
    "country_flag": "https://flagcdn.com/do.svg"
  },
  {
    "country_name": "Norfolk Island",
    "country_description": "Norfolk Island is an external territory of Australia located in the Pacific Ocean between New Zealand and New Caledonia, approximately 1,412 km east of Australia's Evans Head and about 900 km from Lord Howe Island. Together with the neighbouring Phillip Island and Nepean Island, the three islands collectively form the Territory of Norfolk Island. At the 2021 census, it had 2,188 inhabitants living on a total land area of about 35 km2 (14 sq mi). Its capital and administrative seat is Kingston, while its main town and largest settlement is Burnt Pine.",
    "country_capital": "Kingston",
    "country_population": 2302,
    "country_continent": "Oceania",
    "country_language": "English",
    "country_currency": "Australian dollar ($)",
    "country_flag": "https://flagcdn.com/nf.svg"
  },
  {
    "country_name": "Bouvet Island",
    "country_description": "Bouvet Island is an uninhabited subantarctic volcanic island and dependency of Norway. It is a protected nature reserve, and situated in the South Atlantic Ocean at the southern end of the Mid-Atlantic Ridge, it is the world's most remote island. Located north of the Antarctic Circle, Bouvet Island is not part of the southern region covered by the Antarctic Treaty System.",
    "country_population": 0,
    "country_continent": "Antarctic",
    "country_language": "Norwegian",
    "country_currency": "No currency data available",
    "country_flag": "https://flagcdn.com/bv.svg"
  },
  {
    "country_name": "Qatar",
    "country_description": "Qatar, officially the State of Qatar, is a country in West Asia. It occupies the Qatar Peninsula on the northeastern coast of the Arabian Peninsula in the Middle East; it shares its sole land border with Saudi Arabia to the south, with the rest of its territory surrounded by the Persian Gulf. The Gulf of Bahrain, an inlet of the Persian Gulf, separates Qatar from nearby Bahrain. The capital is Doha, home to over 80% of the country's inhabitants. Most of the land area is made up of flat, low-lying desert.",
    "country_capital": "Doha",
    "country_population": 2881060,
    "country_continent": "Asia",
    "country_language": "Arabic",
    "country_currency": "Qatari riyal (ر.ق)",
    "country_flag": "https://flagcdn.com/qa.svg"
  },
  {
    "country_name": "Madagascar",
    "country_description": "Madagascar, officially the Republic of Madagascar, is an island country comprising the island of Madagascar and numerous smaller peripheral islands. Lying off the southeastern coast of Africa, it is the world's fourth largest island, the second-largest island country and the 46th largest country in the world. Its capital and largest city is Antananarivo.",
    "country_capital": "Antananarivo",
    "country_population": 27691019,
    "country_continent": "Africa",
    "country_language": "French",
    "country_currency": "Malagasy ariary (Ar)",
    "country_flag": "https://flagcdn.com/mg.svg"
  },
  {
    "country_name": "India",
    "country_description": "India, officially the Republic of India, is a country in South Asia. It is the seventh-largest country in the world by area and the most populous country. Bounded by the Indian Ocean on the south, the Arabian Sea on the southwest, and the Bay of Bengal on the southeast, it shares land borders with Pakistan to the west; China, Nepal, and Bhutan to the north; and Bangladesh and Myanmar to the east. In the Indian Ocean, India is in the vicinity of Sri Lanka and the Maldives; its Andaman and Nicobar Islands share a maritime border with Thailand, Myanmar, and Indonesia.",
    "country_capital": "New Delhi",
    "country_population": 1380004385,
    "country_continent": "Asia",
    "country_language": "English",
    "country_currency": "Indian rupee (₹)",
    "country_flag": "https://flagcdn.com/in.svg"
  },
  {
    "country_name": "Syria",
    "country_description": "Syria, officially the Syrian Arab Republic, is a country in West Asia located in the Eastern Mediterranean and the Levant. It is bounded by the Mediterranean Sea to the west, Turkey to the north, Iraq to the east and southeast, Jordan to the south, and Israel and Lebanon to the southwest. It is under a transitional government and comprises 14 governorates. Damascus is the capital and largest city. With a population of 25 million across an area of 185,180 square kilometres (71,500 sq mi), it is the 57th-most populous and 87th-largest country.",
    "country_capital": "Damascus",
    "country_population": 17500657,
    "country_continent": "Asia",
    "country_language": "Arabic",
    "country_currency": "Syrian pound (£)",
    "country_flag": "https://flagcdn.com/sy.svg"
  },
  {
    "country_name": "Montenegro",
    "country_description": "Montenegro is a country in Southeastern Europe, on the Balkan Peninsula. Its 25 municipalities have a total population of 633,158 people in an area of 13,812 km2. It is bordered by Bosnia and Herzegovina to the northwest, Serbia to the northeast, Kosovo to the east, Albania to the southeast, Croatia to the west, and has a coastline along the Adriatic Sea to the southwest. The capital and largest city is Podgorica, while Cetinje is the Old Royal Capital and cultural centre.",
    "country_capital": "Podgorica",
    "country_population": 621718,
    "country_continent": "Europe",
    "country_language": "Montenegrin",
    "country_currency": "Euro (€)",
    "country_flag": "https://flagcdn.com/me.svg"
  },
  {
    "country_name": "Eswatini",
    "country_description": "Eswatini, formally the Kingdom of Eswatini and also known by its former official name Swaziland and formerly the Kingdom of Swaziland, is a landlocked country in Southern Africa. It is bordered by Mozambique to its northeast and South Africa to its north, west, south, and southeast. At no more than 200 km (120 mi) north to south and 130 km (81 mi) east to west, Eswatini is one of the smallest countries in Africa; despite this, its climate and topography are diverse, ranging from a cool and mountainous highveld to a hot and dry lowveld.",
    "country_capital": "Mbabane",
    "country_population": 1160164,
    "country_continent": "Africa",
    "country_language": "English",
    "country_currency": "Swazi lilangeni (L)",
    "country_flag": "https://flagcdn.com/sz.svg"
  },
  {
    "country_name": "Paraguay",
    "country_description": "Paraguay, officially the Republic of Paraguay, is a landlocked country in South America. It is bordered by Argentina to the south and southwest, Brazil to the east and northeast, and Bolivia to the northwest. It has a population of around 6.1 million, nearly 2.3 million of whom live in the capital and largest city of Asunción, and its surrounding metro area.",
    "country_capital": "Asunción",
    "country_population": 7132530,
    "country_continent": "Americas",
    "country_language": "Guaraní",
    "country_currency": "Paraguayan guaraní (₲)",
    "country_flag": "https://flagcdn.com/py.svg"
  },
  {
    "country_name": "El Salvador",
    "country_description": "El Salvador, officially the Republic of El Salvador, is a country in Central America. It is bordered on the northeast by Honduras, on the northwest by Guatemala, and on the south by the Pacific Ocean. El Salvador's capital and largest city is San Salvador. The country's population in 2024 was estimated to be 6 million according to a government census.",
    "country_capital": "San Salvador",
    "country_population": 6486201,
    "country_continent": "Americas",
    "country_language": "Spanish",
    "country_currency": "United States dollar ($)",
    "country_flag": "https://flagcdn.com/sv.svg"
  },
  {
    "country_name": "Ukraine",
    "country_description": "Ukraine is a country in Eastern Europe. It is the second-largest European country after Russia, which borders it to the east and northeast. It also borders Belarus to the north; Poland and Slovakia to the west; Hungary, Romania and Moldova to the southwest; with a coastline along the Black Sea and the Sea of Azov to the south and southeast. Kyiv is the nation's capital and largest city, followed by Kharkiv, Dnipro, and Odesa. Ukraine's official language is Ukrainian.",
    "country_capital": "Kyiv",
    "country_population": 44134693,
    "country_continent": "Europe",
    "country_language": "Ukrainian",
    "country_currency": "Ukrainian hryvnia (₴)",
    "country_flag": "https://flagcdn.com/ua.svg"
  },
  {
    "country_name": "Isle of Man",
    "country_description": "The Isle of Man or Mann, is a self-governing British Crown Dependency in the Irish Sea, between Great Britain and Ireland. It is one of the Celtic nations and is the homeland of the Manx people, a Celtic ethnic group. As head of state, Charles III holds the title Lord of Mann and is represented by a Lieutenant Governor. The government of the United Kingdom is responsible for the Isle of Man's military defence and represents it abroad, but the Isle of Man still has a separate international identity.",
    "country_capital": "Douglas",
    "country_population": 85032,
    "country_continent": "Europe",
    "country_language": "English",
    "country_currency": "British pound (£)",
    "country_flag": "https://flagcdn.com/im.svg"
  },
  {
    "country_name": "Namibia",
    "country_description": "Namibia, officially the Republic of Namibia, is a country in Southern Africa. Its western border is the Atlantic Ocean. It shares land borders with Angola and Zambia to the north, Botswana to the east and South Africa to the east and south. Although it does not border Zimbabwe, less than 200 metres of the Botswanan right bank of the Zambezi River separates the two countries. Its capital and largest city is Windhoek.",
    "country_capital": "Windhoek",
    "country_population": 2540916,
    "country_continent": "Africa",
    "country_language": "Afrikaans",
    "country_currency": "Namibian dollar ($)",
    "country_flag": "https://flagcdn.com/na.svg"
  },
  {
    "country_name": "United Arab Emirates",
    "country_description": "The United Arab Emirates (UAE), or simply the Emirates, is a country in West Asia, in the Middle East, at the eastern end of the Arabian Peninsula. It is a federal, elective monarchy composed of seven emirates, with Abu Dhabi as its capital. It shares land borders with Oman to the east and northeast, and with Saudi Arabia to the southwest; as well as maritime borders in the Persian Gulf with Qatar and Iran, and with Oman in the Gulf of Oman. As of 2024, the UAE has an estimated population of over 10 million, of which 11% are Emiratis; Dubai is its most populous city and is an international hub. Islam is the official religion and Arabic is the official language, while English is the most spoken language and the language of business.",
    "country_capital": "Abu Dhabi",
    "country_population": 9890400,
    "country_continent": "Asia",
    "country_language": "Arabic",
    "country_currency": "United Arab Emirates dirham (د.إ)",
    "country_flag": "https://flagcdn.com/ae.svg"
  },
  {
    "country_name": "Bulgaria",
    "country_description": "Bulgaria, officially the Republic of Bulgaria, is a country in Southeast Europe. It is situated on the eastern portion of the Balkans directly south of the Danube river and west of the Black Sea. Bulgaria is bordered by Greece and Turkey to the south, Serbia and North Macedonia to the west, and Romania to the north. It covers a territory of 110,994 square kilometres (42,855 sq mi) and is the sixteenth-largest country in Europe. Sofia is the nation's capital and largest city; other major cities include Burgas, Plovdiv, and Varna.",
    "country_capital": "Sofia",
    "country_population": 6927288,
    "country_continent": "Europe",
    "country_language": "Bulgarian",
    "country_currency": "Bulgarian lev (лв)",
    "country_flag": "https://flagcdn.com/bg.svg"
  },
  {
    "country_name": "Greenland",
    "country_description": "Greenland is a North American island autonomous territory of the Kingdom of Denmark. It is the larger of two autonomous territories within the Kingdom, the other being the Faroe Islands; the citizens of both territories are full citizens of Denmark. As Greenland is one of the Overseas Countries and Territories of the European Union, citizens of Greenland are European Union citizens. The capital and largest city of Greenland is Nuuk. Greenland lies between the Arctic and Atlantic oceans, east of the Canadian Arctic Archipelago. It is the world's largest island, and is the location of the northernmost point of land in the world – Kaffeklubben Island off the northern coast is the world's northernmost undisputed point of land, and Cape Morris Jesup on the mainland was thought to be so until the 1960s.",
    "country_capital": "Nuuk",
    "country_population": 56367,
    "country_continent": "Americas",
    "country_language": "Greenlandic",
    "country_currency": "krone (kr.)",
    "country_flag": "https://flagcdn.com/gl.svg"
  },
  {
    "country_name": "Germany",
    "country_description": "Germany, officially the Federal Republic of Germany, is a country in Central Europe. It lies between the Baltic and North Sea to the north and the Alps to the south. Its sixteen constituent states have a total population of over 82 million in an area of 357,596 km2 (138,069 sq mi), making it the most populous member state of the European Union. It borders Denmark to the north, Poland and the Czech Republic to the east, Austria and Switzerland to the south, and France, Luxembourg, Belgium, and the Netherlands to the west. The nation's capital and most populous city is Berlin and its main financial centre is Frankfurt; the largest urban area is the Ruhr.",
    "country_capital": "Berlin",
    "country_population": 83240525,
    "country_continent": "Europe",
    "country_language": "German",
    "country_currency": "Euro (€)",
    "country_flag": "https://flagcdn.com/de.svg"
  },
  {
    "country_name": "Cambodia",
    "country_description": "Cambodia, officially the Kingdom of Cambodia, is a country in Southeast Asia on the Indochinese Peninsula. It is bordered by Thailand to the northwest, Laos to the north, and Vietnam to the east, and has a coastline along the Gulf of Thailand in the southwest. It spans an area of 181,035 square kilometres, dominated by a low-lying floodplain of the Mekong river and Tonlé Sap, Southeast Asia's largest lake. It is dominated by a tropical climate and is rich in wildlife and biodiversity. Cambodia has a population of about 17 million people, the majority of which are ethnically Khmer. Its capital and most populous city is Phnom Penh, followed by Siem Reap and Battambang.",
    "country_capital": "Phnom Penh",
    "country_population": 16718971,
    "country_continent": "Asia",
    "country_language": "Khmer",
    "country_currency": "Cambodian riel (៛)",
    "country_flag": "https://flagcdn.com/kh.svg"
  },
  {
    "country_name": "Iraq",
    "country_description": "Iraq, officially the Republic of Iraq, is a country in West Asia and a core country in the geopolitical region known as the Middle East. With a population exceeding 46 million, it is the 35th-most populous country. It consists of 18 governorates. The country is bordered by Turkey to the north, Saudi Arabia to the south, Iran to the east, the Persian Gulf and Kuwait to the southeast, Jordan to the southwest, and Syria to the west. The capital and largest city is Baghdad. Iraqi people are diverse; mostly Arabs, as well as Kurds, Turkmen, Yazidis, Assyrians, Armenians, Mandaeans, Persians and Shabakis with similarly diverse geography and wildlife. Most Iraqis are Muslims – minority faiths include Christianity, Yazidism, Zoroastrianism, Mandaeism, Yarsanism and Judaism. The official languages of Iraq are Arabic and Kurdish; others also recognized in specific regions are Assyrian, Turkish, and Armenian.",
    "country_capital": "Baghdad",
    "country_population": 40222503,
    "country_continent": "Asia",
    "country_language": "Arabic",
    "country_currency": "Iraqi dinar (ع.د)",
    "country_flag": "https://flagcdn.com/iq.svg"
  },
  {
    "country_name": "French Southern and Antarctic Lands",
    "country_description": "The French Southern and Antarctic Lands is an overseas territory of France. It consists of:Adélie Land, the French claim on the continent of Antarctica.\nCrozet Islands, a group in the southern Indian Ocean, south of Madagascar.\nKerguelen Islands, a group of volcanic islands in the southern Indian Ocean, southeast of Africa and southwest of Australia.\nSaint Paul and Amsterdam Islands, a group to the north of the Kerguelen Islands.\nScattered Islands, a dispersed group of islands around the coast of Madagascar.",
    "country_capital": "Port-aux-Français",
    "country_population": 400,
    "country_continent": "Antarctic",
    "country_language": "French",
    "country_currency": "Euro (€)",
    "country_flag": "https://flagcdn.com/tf.svg"
  },
  {
    "country_name": "Sweden",
    "country_description": "Sweden, formally the Kingdom of Sweden, is a Nordic country located on the Scandinavian Peninsula in Northern Europe. It borders Norway to the west and north, and Finland to the east.\nAt 450,295 square kilometres (173,860 sq mi), Sweden is the largest Nordic country and the fifth-largest country in Europe. Its capital and largest city is Stockholm. Sweden has a population of 10.6 million, and a low population density of 25.5 inhabitants per square kilometre (66/sq mi); 88% of Swedes reside in urban areas. They are mostly in the central and southern half of the country. Sweden's urban areas together cover 1.5% of its land area. Sweden has a diverse climate owing to the length of the country, which ranges from 55°N to 69°N.",
    "country_capital": "Stockholm",
    "country_population": 10353442,
    "country_continent": "Europe",
    "country_language": "Swedish",
    "country_currency": "Swedish krona (kr)",
    "country_flag": "https://flagcdn.com/se.svg"
  },
  {
    "country_name": "Cuba",
    "country_description": "Cuba, officially the Republic of Cuba, is an island country, comprising the island of Cuba, Isla de la Juventud, and 4,195 islands, islets and cays surrounding the main island. It is located where the northern Caribbean Sea, Gulf of Mexico, and Atlantic Ocean meet. Cuba is located east of the Yucatán Peninsula (Mexico), south of both Florida and the Bahamas, west of Hispaniola, and north of Jamaica and the Cayman Islands. Havana is the largest city and capital. Cuba is the third-most populous country in the Caribbean after Haiti and the Dominican Republic, with about 10 million inhabitants. It is the largest country in the Caribbean by area.",
    "country_capital": "Havana",
    "country_population": 11326616,
    "country_continent": "Americas",
    "country_language": "Spanish",
    "country_currency": "Cuban convertible peso ($)",
    "country_flag": "https://flagcdn.com/cu.svg"
  },
  {
    "country_name": "Kyrgyzstan",
    "country_description": "Kyrgyzstan, officially the Kyrgyz Republic, is a landlocked country in Central Asia, lying in the Tian Shan and Pamir mountain ranges. Bishkek is the capital and largest city. Kyrgyzstan is bordered by Kazakhstan to the north, Uzbekistan to the west, Tajikistan to the south, and China to the east and southeast. Ethnic Kyrgyz make up the majority of the country's over 7 million people, followed by significant minorities of Uzbeks and Russians.",
    "country_capital": "Bishkek",
    "country_population": 6591600,
    "country_continent": "Asia",
    "country_language": "Kyrgyz",
    "country_currency": "Kyrgyzstani som (с)",
    "country_flag": "https://flagcdn.com/kg.svg"
  },
  {
    "country_name": "Russia",
    "country_description": "Russia, or the Russian Federation, is a country spanning Eastern Europe and North Asia. It is the largest country in the world by area, extending across eleven time zones and sharing land borders with fourteen countries. It is the world's ninth-most populous country and Europe's most populous country. Russia is a highly urbanised country, with 16 of its population centres having more than 1 million inhabitants. Its capital and largest city is Moscow. Saint Petersburg is Russia's second-largest city and its cultural capital.",
    "country_capital": "Moscow",
    "country_population": 144104080,
    "country_continent": "Europe",
    "country_language": "Russian",
    "country_currency": "Russian ruble (₽)",
    "country_flag": "https://flagcdn.com/ru.svg"
  },
  {
    "country_name": "Malaysia",
    "country_description": "Malaysia is a country in Southeast Asia. A federal constitutional monarchy, it consists of 13 states and three federal territories, separated by the South China Sea into two regions: Peninsular Malaysia and Borneo's East Malaysia. Peninsular Malaysia shares a land and maritime border with Thailand and maritime borders with Singapore, Vietnam, and Indonesia. East Malaysia shares land borders with Brunei and Indonesia, as well as a maritime border with the Philippines and Vietnam. Kuala Lumpur is the national capital, the country's largest city, and the seat of the legislative branch of the federal government.\nPutrajaya is the administrative centre, which represents the seat of both the executive branch and the judicial branch of the federal government. With a population of over 34 million, the country is the world's 43rd-most populous country. Malaysia is tropical and is one of 17 megadiverse countries; it is home to numerous endemic species. Tanjung Piai in the Malaysian state of Johor is the southernmost point of continental Eurasia.",
    "country_capital": "Kuala Lumpur",
    "country_population": 32365998,
    "country_continent": "Asia",
    "country_language": "English",
    "country_currency": "Malaysian ringgit (RM)",
    "country_flag": "https://flagcdn.com/my.svg"
  },
  {
    "country_name": "São Tomé and Príncipe",
    "country_description": "São Tomé and Príncipe, officially the Democratic Republic of São Tomé and Príncipe, is an island country in the Gulf of Guinea, off the western equatorial coast of Central Africa. It consists of two archipelagos around the two main islands of São Tomé and Príncipe, about 150 km (93.21 mi) apart and about 250 and 225 km off the northwestern coast of Gabon. With a population of 201,800, São Tomé and Príncipe is the second-smallest and second-least populous African sovereign state after Seychelles.",
    "country_capital": "São Tomé",
    "country_population": 219161,
    "country_continent": "Africa",
    "country_language": "Portuguese",
    "country_currency": "São Tomé and Príncipe dobra (Db)",
    "country_flag": "https://flagcdn.com/st.svg"
  },
  {
    "country_name": "Cyprus",
    "country_description": "Cyprus, officially the Republic of Cyprus, is an island country in the eastern Mediterranean Sea. Although it is geographically located in West Asia, its cultural identity and geopolitical make-up are overwhelmingly Southeast European. It is the third largest and third most populous island in the Mediterranean. It is located southeast of Greece, south of Turkey, west of Syria and Lebanon, northwest of Israel and Palestine, and north of Egypt. Its capital and largest city is Nicosia. Cyprus also hosts the British-controlled military bases Akrotiri and Dhekelia, whilst the northeast portion of the island is de facto governed by the self-declared Turkish Republic of Northern Cyprus, which is separated from the Republic of Cyprus by the United Nations Buffer Zone.",
    "country_capital": "Nicosia",
    "country_population": 1207361,
    "country_continent": "Europe",
    "country_language": "Greek",
    "country_currency": "Euro (€)",
    "country_flag": "https://flagcdn.com/cy.svg"
  },
  {
    "country_name": "Canada",
    "country_description": "Canada is a country in North America. Its ten provinces and three territories extend from the Atlantic Ocean to the Pacific Ocean and northward into the Arctic Ocean, making it the world's second-largest country by total area, with the world's longest coastline. Its border with the United States is the world's longest international land border. The country is characterized by a wide range of both meteorologic and geological regions. With a population of just over 41 million people, it has widely varying population densities, with the majority residing in urban areas and large areas of the country being sparsely populated. Canada's capital is Ottawa and its three largest metropolitan areas are Toronto, Montreal, and Vancouver.",
    "country_capital": "Ottawa",
    "country_population": 38005238,
    "country_continent": "Americas",
    "country_language": "English",
    "country_currency": "Canadian dollar ($)",
    "country_flag": "https://flagcdn.com/ca.svg"
  },
  {
    "country_name": "Malawi",
    "country_description": "Malawi, officially the Republic of Malawi and formerly known as Nyasaland, is a landlocked country in Southeastern Africa. It is bordered by Zambia to the west, Tanzania to the north and northeast, and Mozambique to the east, south, and southwest. Malawi spans over 118,484 km2 (45,747 sq mi) and has an estimated population of 21,240,689. Malawi's capital and largest city is Lilongwe. Its second-largest is Blantyre, its third-largest is Mzuzu, and its fourth-largest is Zomba, the former capital.",
    "country_capital": "Lilongwe",
    "country_population": 19129955,
    "country_continent": "Africa",
    "country_language": "English",
    "country_currency": "Malawian kwacha (MK)",
    "country_flag": "https://flagcdn.com/mw.svg"
  },
  {
    "country_name": "Saudi Arabia",
    "country_description": "Saudi Arabia, officially the Kingdom of Saudi Arabia (KSA), is a country in West Asia. Located in the centre of the Middle East, it is one of the countries situated in the Gulf region. It covers the bulk of the Arabian Peninsula and has a land area of about 2,150,000 km2 (830,000 sq mi), making it the fifth-largest country in Asia, the largest in the Middle East, and the 12th-largest in the world. It is bordered by the Red Sea to the west; Jordan, Iraq, and Kuwait to the north; the Persian Gulf, Bahrain, Qatar and the United Arab Emirates to the east; Oman to the southeast; and Yemen to the south. The Gulf of Aqaba in the northwest separates Saudi Arabia from Egypt and Israel. Saudi Arabia is the only country with a coastline along both the Red Sea and the Persian Gulf, and most of its terrain consists of arid desert, lowland, steppe, and mountains. The capital and largest city is Riyadh; other major cities include Jeddah and the two holiest cities in Islam, Mecca and Medina. With a population of almost 32.2 million, Saudi Arabia is the fourth most populous country in the Arab world.",
    "country_capital": "Riyadh",
    "country_population": 34813867,
    "country_continent": "Asia",
    "country_language": "Arabic",
    "country_currency": "Saudi riyal (ر.س)",
    "country_flag": "https://flagcdn.com/sa.svg"
  },
  {
    "country_name": "Bosnia and Herzegovina",
    "country_description": "Bosnia and Herzegovina, sometimes known as Bosnia-Herzegovina and informally as Bosnia, is a country in Southeast Europe, situated on the Balkan Peninsula. It borders Serbia to the east, Montenegro to the southeast, and Croatia to the north and southwest. In the south it has a 20 kilometres long coast on the Adriatic Sea, with the town of Neum being its only access to the sea. Bosnia has a moderate continental climate with hot summers and cold, snowy winters. In the central and eastern regions, the geography is mountainous, in the northwest it is moderately hilly, and in the northeast it is predominantly flat. Herzegovina, the smaller, southern region, has a Mediterranean climate and is mostly mountainous. Sarajevo is the capital and the largest city.",
    "country_capital": "Sarajevo",
    "country_population": 3280815,
    "country_continent": "Europe",
    "country_language": "Bosnian",
    "country_currency": "Bosnia and Herzegovina convertible mark (KM)",
    "country_flag": "https://flagcdn.com/ba.svg"
  },
  {
    "country_name": "Ethiopia",
    "country_description": "Ethiopia, officially the Federal Democratic Republic of Ethiopia, is a landlocked country located in the Horn of Africa region of East Africa. It shares borders with Eritrea to the north, Djibouti to the northeast, Somalia to the east, Kenya to the south, South Sudan to the west, and Sudan to the northwest. Ethiopia covers a land area of 1,104,300 square kilometres (426,400 sq mi). As of 2024, it is home to around 132 million inhabitants, making it the 10th-most populous country in the world, the 2nd-most populous in Africa after Nigeria, and the most populated landlocked country on Earth. The national capital and largest city, Addis Ababa, lies several kilometres west of the East African Rift that splits the country into the African and Somali tectonic plates.",
    "country_capital": "Addis Ababa",
    "country_population": 114963583,
    "country_continent": "Africa",
    "country_language": "Amharic",
    "country_currency": "Ethiopian birr (Br)",
    "country_flag": "https://flagcdn.com/et.svg"
  },
  {
    "country_name": "Spain",
    "country_description": "Spain, officially the Kingdom of Spain, is a country in Southwestern Europe with territories in North Africa. Featuring the southernmost point of continental Europe, it is the largest country in Southern Europe and the fourth-most populous European Union member state. Spanning across the majority of the Iberian Peninsula, its territory also includes the Canary Islands, in the Eastern Atlantic Ocean, the Balearic Islands, in the Western Mediterranean Sea, and the autonomous cities of Ceuta and Melilla, in Africa. Peninsular Spain is bordered to the north by France, Andorra, and the Bay of Biscay; to the east and south by the Mediterranean Sea and Gibraltar; and to the west by Portugal and the Atlantic Ocean. Spain's capital and largest city is Madrid, and other major urban areas include Barcelona, Valencia, Seville, Zaragoza, Málaga, Murcia and Palma de Mallorca.",
    "country_capital": "Madrid",
    "country_population": 47351567,
    "country_continent": "Europe",
    "country_language": "Spanish",
    "country_currency": "Euro (€)",
    "country_flag": "https://flagcdn.com/es.svg"
  },
  {
    "country_name": "Slovenia",
    "country_description": "Slovenia officially the Republic of Slovenia is a country in Central Europe. It borders Italy to the west, Austria to the north, Hungary to the northeast, Croatia to the south and southeast, and a short coastline within the Adriatic Sea to the southwest, which is part of the Mediterranean sea. Slovenia is mostly mountainous and forested, covers 20,271 square kilometres (7,827 sq mi), and has a population of approximately 2.1 million. Slovene is the official language. Slovenia has a predominantly temperate continental climate, with the exception of the Slovene Littoral and the Julian Alps. Ljubljana, the capital and largest city of Slovenia, is geographically situated near the centre of the country. Other larger urban centers are Maribor, Kranj, Celje and Koper.",
    "country_capital": "Ljubljana",
    "country_population": 2100126,
    "country_continent": "Europe",
    "country_language": "Slovene",
    "country_currency": "Euro (€)",
    "country_flag": "https://flagcdn.com/si.svg"
  },
  {
    "country_name": "Oman",
    "country_description": "Oman, officially the Sultanate of Oman, is a country on the southeastern coast of the Arabian Peninsula in West Asia. It overlooks the mouth of the Persian Gulf. It shares land borders with Saudi Arabia, the United Arab Emirates, and Yemen. The capital and largest city is Muscat. Oman has a population of about 5.28 million as of 2024, which is a 4.60% population increase from 2023. and is the 123rd most-populous country. The coast faces the Arabian Sea on the southeast, and the Gulf of Oman on the northeast. The Madha and Musandam exclaves are surrounded by United Arab Emirates on their land borders, with the Strait of Hormuz and the Gulf of Oman forming Musandam's coastal boundaries.",
    "country_capital": "Muscat",
    "country_population": 5106622,
    "country_continent": "Asia",
    "country_language": "Arabic",
    "country_currency": "Omani rial (ر.ع.)",
    "country_flag": "https://flagcdn.com/om.svg"
  },
  {
    "country_name": "Saint Pierre and Miquelon",
    "country_description": "Saint Pierre and Miquelon, officially the Overseas Collectivity of Saint-Pierre and Miquelon, is a self-governing territorial overseas collectivity of France in the northwestern Atlantic Ocean, located near the Canadian province of Newfoundland and Labrador. An archipelago of eight islands, St. Pierre and Miquelon is a vestige of the once-vast territory of New France. Its residents are French citizens. The collectivity elects its own deputy to the National Assembly and participates in senatorial and presidential elections. It covers 242 km2 (93 sq mi) of land and had a population of 6,008 as of the March 2016 census.",
    "country_capital": "Saint-Pierre",
    "country_population": 6069,
    "country_continent": "Americas",
    "country_language": "French",
    "country_currency": "Euro (€)",
    "country_flag": "https://flagcdn.com/pm.svg"
  },
  {
    "country_name": "Macau",
    "country_description": "Macau or Macao is a special administrative region of the People's Republic of China. With a population of about 710,000 people and a land area of 32.9 km2 (12.7 sq mi), it is the most densely populated region in the world.",
    "country_population": 649342,
    "country_continent": "Asia",
    "country_language": "Portuguese",
    "country_currency": "Macanese pataca (P)",
    "country_flag": "https://flagcdn.com/mo.svg"
  },
  {
    "country_name": "San Marino",
    "country_description": "San Marino, officially the Most Serene Republic of San Marino and also known as the Republic of San Marino, is the oldest existing representative republic and the European state with the smallest population, apart from Vatican City. It is the larger of the two microstates surrounded by Italy. Located on the northeastern side of the Apennine Mountains, it is the fifth-smallest country in the world, with a land area of just over 61 km2 and a population of 33,642, as of 2023.",
    "country_capital": "City of San Marino",
    "country_population": 33938,
    "country_continent": "Europe",
    "country_language": "Italian",
    "country_currency": "Euro (€)",
    "country_flag": "https://flagcdn.com/sm.svg"
  },
  {
    "country_name": "Lesotho",
    "country_description": "Lesotho, formally the Kingdom of Lesotho, formerly known as Basutoland, is a landlocked country in Southern Africa. As an enclave of South Africa, with which it shares a 1,106 km (687 mi) border, it is the largest sovereign enclave in the world, and the only one outside of the Italian Peninsula. It is situated in the Maloti Mountains and contains the highest peak in Southern Africa. It has an area of over 30,000 km2 (11,600 sq mi) and has a population of about two million. Its capital and largest city is Maseru. The country is also known by the nickname The Mountain Kingdom/The Kingdom in the Sky.",
    "country_capital": "Maseru",
    "country_population": 2142252,
    "country_continent": "Africa",
    "country_language": "English",
    "country_currency": "Lesotho loti (L)",
    "country_flag": "https://flagcdn.com/ls.svg"
  },
  {
    "country_name": "Marshall Islands",
    "country_description": "The Marshall Islands, officially the Republic of the Marshall Islands, is an island country west of the International Date Line and north of the equator in the Micronesia region of the Northwestern Pacific Ocean.",
    "country_capital": "Majuro",
    "country_population": 59194,
    "country_continent": "Oceania",
    "country_language": "English",
    "country_currency": "United States dollar ($)",
    "country_flag": "https://flagcdn.com/mh.svg"
  },
  {
    "country_name": "Sint Maarten",
    "country_description": "Sint Maarten is a constituent country of the Kingdom of the Netherlands located in the Caribbean region of North America. With a population of 58,477 as of June 2023 on an area of 34 km2 (13 sq mi), it encompasses the southern 44% of the divided island of Saint Martin, while the northern 56% of the island constitutes the French overseas collectivity of Saint Martin. Sint Maarten's capital is Philipsburg. Collectively, Sint Maarten and the other Dutch islands in the Caribbean are often called the Dutch Caribbean.",
    "country_capital": "Philipsburg",
    "country_population": 40812,
    "country_continent": "Americas",
    "country_language": "English",
    "country_currency": "Netherlands Antillean guilder (ƒ)",
    "country_flag": "https://flagcdn.com/sx.svg"
  },
  {
    "country_name": "Iceland",
    "country_description": "Iceland is a Nordic island country between the North Atlantic and Arctic Oceans, on the Mid-Atlantic Ridge between North America and Europe. It is culturally and politically linked with Europe and is the region's westernmost and most sparsely populated country. Its capital and largest city is Reykjavík, which is home to about 36% of the country's roughly 380,000 residents. The official language of the country is Icelandic.\nIceland is on a rift between tectonic plates, and its geologic activity includes geysers and frequent volcanic eruptions. The interior consists of a volcanic plateau with sand and lava fields, mountains and glaciers, and many glacial rivers flow to the sea through the lowlands. Iceland is warmed by the Gulf Stream and has a temperate climate, despite a latitude just south of the Arctic Circle. Its latitude and marine influence keep summers chilly, and most of its islands have a polar climate.",
    "country_capital": "Reykjavik",
    "country_population": 366425,
    "country_continent": "Europe",
    "country_language": "Icelandic",
    "country_currency": "Icelandic króna (kr)",
    "country_flag": "https://flagcdn.com/is.svg"
  },
  {
    "country_name": "Luxembourg",
    "country_description": "Luxembourg, officially the Grand Duchy of Luxembourg, is a landlocked country in Western Europe. It is bordered by Belgium to the west and north, Germany to the east, and France to the south. Its capital and most populous city, Luxembourg City, is one of the four institutional seats of the European Union and the seat of several EU institutions, notably the Court of Justice of the European Union, the highest judicial authority. Luxembourg's culture, people, and languages are greatly influenced by its much larger neighbors France and Germany; for example, Luxembourgish, a Germanic language, is the only national language of the Luxembourgish people and of the Grand Duchy of Luxembourg, French is the only language for legislation, and all three – Luxembourgish, German and French – are used for administrative matters in the country.",
    "country_capital": "Luxembourg",
    "country_population": 632275,
    "country_continent": "Europe",
    "country_language": "German",
    "country_currency": "Euro (€)",
    "country_flag": "https://flagcdn.com/lu.svg"
  },
  {
    "country_name": "Argentina",
    "country_description": "Argentina, officially the Argentine Republic, is a country in the southern half of South America. Argentina covers an area of 2,780,400 km2 (1,073,500 sq mi), making it the second-largest country in South America after Brazil, the fourth-largest country in the Americas, and the eighth-largest country in the world. It shares the bulk of the Southern Cone with Chile to the west, and is also bordered by Bolivia and Paraguay to the north, Brazil to the northeast, Uruguay and the South Atlantic Ocean to the east, and the Drake Passage to the south. Argentina is a federal state subdivided into twenty-three provinces, and one autonomous city, which is the federal capital and largest city of the nation, Buenos Aires. The provinces and the capital have their own constitutions, but exist under a federal system. Argentina claims sovereignty over the Falkland Islands, South Georgia and the South Sandwich Islands, the Southern Patagonian Ice Field, and a part of Antarctica.",
    "country_capital": "Buenos Aires",
    "country_population": 45376763,
    "country_continent": "Americas",
    "country_language": "Guaraní",
    "country_currency": "Argentine peso ($)",
    "country_flag": "https://flagcdn.com/ar.svg"
  },
  {
    "country_name": "Turks and Caicos Islands",
    "country_description": "The Turks and Caicos Islands are a British Overseas Territory consisting of the larger Caicos Islands and smaller Turks Islands, two groups of tropical islands in the Lucayan Archipelago of the Atlantic Ocean and northern West Indies. They are known primarily for tourism and as an offshore financial centre. The resident population in 2023 was estimated by The World Factbook at 59,367, making it the third-largest of the British overseas territories by population. However, according to a Department of Statistics estimate in 2022, the population was 47,720.",
    "country_capital": "Cockburn Town",
    "country_population": 38718,
    "country_continent": "Americas",
    "country_language": "English",
    "country_currency": "United States dollar ($)",
    "country_flag": "https://flagcdn.com/tc.svg"
  },
  {
    "country_name": "Nauru",
    "country_description": "Nauru, officially the Republic of Nauru and formerly known as Pleasant Island, is an island country and microstate in Micronesia, part of the Oceania region in the Central Pacific. Its nearest neighbour is Banaba of Kiribati about 300 km (190 mi) to the east.",
    "country_capital": "Yaren",
    "country_population": 10834,
    "country_continent": "Oceania",
    "country_language": "English",
    "country_currency": "Australian dollar ($)",
    "country_flag": "https://flagcdn.com/nr.svg"
  },
  {
    "country_name": "Cocos (Keeling) Islands",
    "country_description": "The Cocos (Keeling) Islands, officially the Territory of Cocos (Keeling) Islands, are an Australian external territory in the Indian Ocean, comprising a small archipelago approximately midway between Australia and Sri Lanka and relatively close to the Indonesian island of Sumatra. The territory's dual name reflects that the islands have historically been known as either the Cocos Islands or the Keeling Islands.",
    "country_capital": "West Island",
    "country_population": 544,
    "country_continent": "Oceania",
    "country_language": "English",
    "country_currency": "Australian dollar ($)",
    "country_flag": "https://flagcdn.com/cc.svg"
  },
  {
    "country_name": "Western Sahara",
    "country_description": "Western Sahara is a disputed territory in North-western Africa. It has a surface area of 272,000 square kilometres (105,000 sq mi). Approximately 30% of the territory is controlled by the Sahrawi Arab Democratic Republic (SADR); the remaining 70% is occupied and administered by neighboring Morocco. It is the most sparsely populated territory in Africa and the second most sparsely populated territory in the world, mainly consisting of desert flatlands. The population is estimated at 618,600. Nearly 40% of that population lives in Morocco-controlled Laayoune, the largest city of Western Sahara.",
    "country_capital": "El Aaiún",
    "country_population": 510713,
    "country_continent": "Africa",
    "country_language": "Berber",
    "country_currency": "Algerian dinar (دج)",
    "country_flag": "https://flagcdn.com/eh.svg"
  },
  {
    "country_name": "Dominica",
    "country_description": "Dominica, officially the Commonwealth of Dominica, is an island country in the Caribbean. It is part of the Windward Islands chain in the Lesser Antilles archipelago in the Caribbean Sea. The capital, Roseau, is located on the western side of the island. Dominica's closest neighbours are two constituent territories of the European Union, the overseas departments of France, Guadeloupe to the northwest and Martinique to the south-southeast. Dominica comprises a land area of 750 km2 (290 sq mi), and the highest point is Morne Diablotins, at 1,447 m (4,747 ft) in elevation. The population was 71,293 at the 2011 census.",
    "country_capital": "Roseau",
    "country_population": 71991,
    "country_continent": "Americas",
    "country_language": "English",
    "country_currency": "Eastern Caribbean dollar ($)",
    "country_flag": "https://flagcdn.com/dm.svg"
  },
  {
    "country_name": "Costa Rica",
    "country_description": "Costa Rica, officially the Republic of Costa Rica, is a country in the Central American region of North America. It borders Nicaragua to the north, the Caribbean Sea to the northeast, Panama to the southeast, and the Pacific Ocean to the southwest, as well as maritime border with Ecuador to the south of Cocos Island. It has a population of around five million in a land area of nearly 51,180 km2 (19,760 sq mi). An estimated 352,381 people live in the capital and largest city, San José, with around two million people in the surrounding metropolitan area.",
    "country_capital": "San José",
    "country_population": 5094114,
    "country_continent": "Americas",
    "country_language": "Spanish",
    "country_currency": "Costa Rican colón (₡)",
    "country_flag": "https://flagcdn.com/cr.svg"
  },
  {
    "country_name": "Australia",
    "country_description": "Australia, officially the Commonwealth of Australia, is a country comprising the mainland of the Australian continent, the island of Tasmania and numerous smaller islands. Australia has a total area of 7,688,287 km2 (2,968,464 sq mi), making it the sixth-largest country in the world and the largest in Oceania. It is the world's oldest, flattest, and driest inhabited continent, with some of the least fertile soils. It is a megadiverse country, and its size gives it a wide variety of landscapes and climates including deserts in the interior and tropical rainforests along the coast.",
    "country_capital": "Canberra",
    "country_population": 25687041,
    "country_continent": "Oceania",
    "country_language": "English",
    "country_currency": "Australian dollar ($)",
    "country_flag": "https://flagcdn.com/au.svg"
  },
  {
    "country_name": "Thailand",
    "country_description": "Thailand, officially the Kingdom of Thailand and historically known as Siam, is a country in Southeast Asia on the Indochinese Peninsula. With a population of almost 66 million, it spans 513,115 square kilometres (198,115 sq mi). Thailand is bordered to the northwest by Myanmar, to the northeast and east by Laos, to the southeast by Cambodia, to the south by the Gulf of Thailand and Malaysia, and to the southwest by the Andaman Sea; it also shares maritime borders with Vietnam to the southeast and Indonesia and India to the southwest. Bangkok is the state capital and largest city.",
    "country_capital": "Bangkok",
    "country_population": 69799978,
    "country_continent": "Asia",
    "country_language": "Thai",
    "country_currency": "Thai baht (฿)",
    "country_flag": "https://flagcdn.com/th.svg"
  },
  {
    "country_name": "Haiti",
    "country_description": "Haiti, officially the Republic of Haiti, is a country on the island of Hispaniola in the Caribbean Sea, east of Cuba and Jamaica, and south of The Bahamas. It occupies the western three-eighths of the island, which it shares with the Dominican Republic. Haiti is the third largest country in the Caribbean, and with an estimated population of 11.4 million, is the most populous Caribbean country. The capital and largest city is Port-au-Prince.",
    "country_capital": "Port-au-Prince",
    "country_population": 11402533,
    "country_continent": "Americas",
    "country_language": "French",
    "country_currency": "Haitian gourde (G)",
    "country_flag": "https://flagcdn.com/ht.svg"
  },
  {
    "country_name": "Tuvalu",
    "country_description": "Tuvalu is an island country in the Polynesian subregion of Oceania in the Pacific Ocean, about midway between Hawaii and Australia. It lies east-northeast of the Santa Cruz Islands, northeast of Vanuatu, southeast of Nauru, south of Kiribati, west of Tokelau, northwest of Samoa and Wallis and Futuna, and north of Fiji.",
    "country_capital": "Funafuti",
    "country_population": 11792,
    "country_continent": "Oceania",
    "country_language": "English",
    "country_currency": "Australian dollar ($)",
    "country_flag": "https://flagcdn.com/tv.svg"
  },
  {
    "country_name": "Honduras",
    "country_description": "Honduras, officially the Republic of Honduras, is a country in Central America. It is bordered to the west by Guatemala, to the southwest by El Salvador, to the southeast by Nicaragua, to the south by the Pacific Ocean at the Gulf of Fonseca, and to the north by the Gulf of Honduras, a large inlet of the Caribbean Sea. Its capital and largest city is Tegucigalpa.",
    "country_capital": "Tegucigalpa",
    "country_population": 9904608,
    "country_continent": "Americas",
    "country_language": "Spanish",
    "country_currency": "Honduran lempira (L)",
    "country_flag": "https://flagcdn.com/hn.svg"
  },
  {
    "country_name": "Equatorial Guinea",
    "country_description": "Equatorial Guinea, officially the Republic of Equatorial Guinea, is a country on the west coast of Central Africa, with an area of 28,000 square kilometres (11,000 sq mi). Formerly the colony of Spanish Guinea, its post-independence name refers to its location near both the Equator and in the African region of Guinea. As of 2024, the country had a population of 1,795,834, over 85% of whom are members of the Fang people, the country's dominant ethnic group. The Bubi people, indigenous to Bioko, are the second largest group at approximately 6.5% of the population.",
    "country_capital": "Malabo",
    "country_population": 1402985,
    "country_continent": "Africa",
    "country_language": "French",
    "country_currency": "Central African CFA franc (Fr)",
    "country_flag": "https://flagcdn.com/gq.svg"
  },
  {
    "country_name": "Saint Lucia",
    "country_description": "Saint Lucia is an island country of the West Indies in the eastern Caribbean. Part of the Windward Islands of the Lesser Antilles, it is located north/northeast of the island of Saint Vincent, northwest of Barbados and south of Martinique. It covers a land area of 617 km2 with an estimated population of over 180,000 people as of 2018. The nation's capital and largest city is Castries.",
    "country_capital": "Castries",
    "country_population": 183629,
    "country_continent": "Americas",
    "country_language": "English",
    "country_currency": "Eastern Caribbean dollar ($)",
    "country_flag": "https://flagcdn.com/lc.svg"
  },
  {
    "country_name": "French Polynesia",
    "country_description": "French Polynesia is an overseas collectivity of France and its sole overseas country. It comprises 121 geographically dispersed islands and atolls stretching over more than 2,000 kilometres (1,200 mi) in the South Pacific Ocean. The total land area of French Polynesia is 3,521 square kilometres (1,359 sq mi), with a population of 278,786 of which at least 205,000 live in the Society Islands and the remaining population lives in the rest of the archipelago.",
    "country_capital": "Papeetē",
    "country_population": 280904,
    "country_continent": "Oceania",
    "country_language": "French",
    "country_currency": "CFP franc (₣)",
    "country_flag": "https://flagcdn.com/pf.svg"
  },
  {
    "country_name": "Belarus",
    "country_description": "Belarus, officially the Republic of Belarus, is a landlocked country in Eastern Europe. It is bordered by Russia to the east and northeast, Ukraine to the south, Poland to the west, and Lithuania and Latvia to the northwest. Belarus spans an area of 207,600 square kilometres (80,200 sq mi) with a population of 9.1 million. The country has a hemiboreal climate and is administratively divided into six regions. Minsk is the capital and largest city; it is administered separately as a city with special status.",
    "country_capital": "Minsk",
    "country_population": 9398861,
    "country_continent": "Europe",
    "country_language": "Belarusian",
    "country_currency": "Belarusian ruble (Br)",
    "country_flag": "https://flagcdn.com/by.svg"
  },
  {
    "country_name": "Latvia",
    "country_description": "Latvia, officially the Republic of Latvia, is a country in the Baltic region of Northern Europe. It is one of the three Baltic states, along with Estonia to the north and Lithuania to the south. It borders Russia to the east and Belarus to the southeast, and shares a maritime border with Sweden to the west. Latvia covers an area of 64,589 km2 (24,938 sq mi), with a population of 1.9 million. The country has a temperate seasonal climate. Its capital and largest city is Riga. Latvians, who are the titular nation and comprise 63.0% of the country's population, belong to the ethnolinguistic group of the Balts and speak Latvian. Russians are the most prominent minority in the country, at almost a quarter of the population; 37.7% of the population speak Russian as their native tongue.",
    "country_capital": "Riga",
    "country_population": 1901548,
    "country_continent": "Europe",
    "country_language": "Latvian",
    "country_currency": "Euro (€)",
    "country_flag": "https://flagcdn.com/lv.svg"
  },
  {
    "country_name": "Palau",
    "country_description": "Palau, officially the Republic of Palau, is an island country in the Micronesia subregion of Oceania in the western Pacific. The republic consists of approximately 340 islands and connects the western chain of the Caroline Islands with parts of the Federated States of Micronesia.",
    "country_capital": "Ngerulmud",
    "country_population": 18092,
    "country_continent": "Oceania",
    "country_language": "English",
    "country_currency": "United States dollar ($)",
    "country_flag": "https://flagcdn.com/pw.svg"
  },
  {
    "country_name": "Guadeloupe",
    "country_description": "Guadeloupe is an overseas department and region of France in the Caribbean. It consists of six inhabited islands—Basse-Terre, Grande-Terre, Marie-Galante, La Désirade, and two Îles des Saintes—as well as many uninhabited islands and outcroppings. It is south of Antigua and Barbuda and Montserrat and north of Dominica. The capital city is Basse-Terre, on the southern west coast of Basse-Terre Island; the most populous city is Les Abymes and the main centre of business is neighbouring Pointe-à-Pitre, both on Grande-Terre Island. It had a population of 395,726 in 2024.",
    "country_capital": "Basse-Terre",
    "country_population": 400132,
    "country_continent": "Americas",
    "country_language": "French",
    "country_currency": "Euro (€)",
    "country_flag": "https://flagcdn.com/gp.svg"
  },
  {
    "country_name": "Philippines",
    "country_description": "The Philippines, officially the Republic of the Philippines, is an archipelagic country in Southeast Asia. In the western Pacific Ocean, it consists of 7,641 islands, with a total area of roughly 300,000 square kilometers, which are broadly categorized in three main geographical divisions from north to south: Luzon, Visayas, and Mindanao. The Philippines is bounded by the South China Sea to the west, the Philippine Sea to the east, and the Celebes Sea to the south. It shares maritime borders with Taiwan to the north, Japan to the northeast, Palau to the east and southeast, Indonesia to the south, Malaysia to the southwest, Vietnam to the west, and China to the northwest. It is the world's twelfth-most-populous country, with diverse ethnicities and cultures. Manila is the country's capital, and its most populated city is Quezon City. Both are within Metro Manila.",
    "country_capital": "Manila",
    "country_population": 109581085,
    "country_continent": "Asia",
    "country_language": "English",
    "country_currency": "Philippine peso (₱)",
    "country_flag": "https://flagcdn.com/ph.svg"
  },
  {
    "country_name": "Gibraltar",
    "country_description": "Gibraltar is a British Overseas Territory and city located at the southern tip of the Iberian Peninsula, on the Bay of Gibraltar, near the exit of the Mediterranean Sea into the Atlantic Ocean. It has an area of 6.8 km2 (2.6 sq mi) and is bordered to the north by Spain. The landscape is dominated by the Rock of Gibraltar, at the foot of which is a densely populated town area, home to some 34,003 people, primarily Gibraltarians.",
    "country_capital": "Gibraltar",
    "country_population": 33691,
    "country_continent": "Europe",
    "country_language": "English",
    "country_currency": "Gibraltar pound (£)",
    "country_flag": "https://flagcdn.com/gi.svg"
  },
  {
    "country_name": "Denmark",
    "country_description": "Denmark is a Nordic country in Northern Europe. It is the metropole and most populous constituent of the Kingdom of Denmark, also known as the Danish Realm, a constitutionally unitary state that includes the autonomous territories of the Faroe Islands and Greenland in the north Atlantic Ocean. Metropolitan Denmark, also called \"continental Denmark\" or \"Denmark proper\", consists of the northern Jutland peninsula and an archipelago of 406 islands. It is the southernmost of the Scandinavian countries, lying southwest and south of Sweden, south of Norway, and north of Germany, with which it shares a short border. Denmark proper is situated between the North Sea to the west and the Baltic Sea to the east.",
    "country_capital": "Copenhagen",
    "country_population": 5831404,
    "country_continent": "Europe",
    "country_language": "Danish",
    "country_currency": "Danish krone (kr)",
    "country_flag": "https://flagcdn.com/dk.svg"
  },
  {
    "country_name": "Cameroon",
    "country_description": "Cameroon, officially the Republic of Cameroon, is a country in Central Africa. It shares boundaries with Nigeria to the west and north, Chad to the northeast, the Central African Republic to the east, and Equatorial Guinea, Gabon, and the Republic of the Congo to the south. Its coastline lies on the Bight of Biafra, part of the Gulf of Guinea, and the Atlantic Ocean. Due to its strategic position at the crossroads between West Africa and Central Africa, it has been categorized as being in both camps. Cameroon's population of nearly 31 million people speak 250 native languages, in addition to the national tongues of English and French, or both. Early inhabitants of the territory included the Sao civilisation around Lake Chad and the Baka hunter-gatherers in the southeastern rainforest. Portuguese explorers reached the coast in the 15th century and named the area Rio dos Camarões, which became Cameroon in English. Fulani soldiers founded the Adamawa Emirate in the north in the 19th century, and various ethnic groups of the west and northwest established powerful chiefdoms and fondoms.",
    "country_capital": "Yaoundé",
    "country_population": 26545864,
    "country_continent": "Africa",
    "country_language": "English",
    "country_currency": "Central African CFA franc (Fr)",
    "country_flag": "https://flagcdn.com/cm.svg"
  },
  {
    "country_name": "Guinea",
    "country_description": "Guinea, officially the Republic of Guinea, is a coastal country in West Africa. It borders the Atlantic Ocean to the west, Guinea-Bissau to the northwest, Senegal to the north, Mali to the northeast, Côte d'Ivoire to the southeast, and Sierra Leone and Liberia to the south. It is sometimes referred to as Guinea-Conakry, after its capital Conakry, to distinguish it from other territories in the eponymous region, such as Guinea-Bissau and Equatorial Guinea. Guinea has a population of 14 million and an area of 245,857 square kilometres (94,926 sq mi).",
    "country_capital": "Conakry",
    "country_population": 13132792,
    "country_continent": "Africa",
    "country_language": "French",
    "country_currency": "Guinean franc (Fr)",
    "country_flag": "https://flagcdn.com/gn.svg"
  },
  {
    "country_name": "Bahrain",
    "country_description": "Bahrain, officially the Kingdom of Bahrain, is an island country in West Asia. It is situated on the Persian Gulf, and comprises a small archipelago made up of 50 natural islands and an additional 33 artificial islands, centered on Bahrain Island which makes up around 83 percent of the country's landmass. Bahrain is situated between Qatar and the northeastern coast of Saudi Arabia, to which it is connected by the King Fahd Causeway. The population of Bahrain is 1,501,635 as of May 14, 2023, based on elaborations of the United Nations data, of whom 712,362 are Bahraini nationals. Bahrain spans some 760 square kilometres (290 sq mi), and is the third-smallest nation in Asia after the Maldives and Singapore. The capital and largest city is Manama.",
    "country_capital": "Manama",
    "country_population": 1701583,
    "country_continent": "Asia",
    "country_language": "Arabic",
    "country_currency": "Bahraini dinar (.د.ب)",
    "country_flag": "https://flagcdn.com/bh.svg"
  },
  {
    "country_name": "Suriname",
    "country_description": "Suriname, officially the Republic of Suriname, is a country in northern South America, sometimes considered part of the Caribbean and the West Indies. It is a developing country with a medium level of human development; its economy is heavily dependent on its abundant natural resources, namely bauxite, gold, petroleum, and agricultural products. Suriname is a member of the Caribbean Community (CARICOM), the United Nations, and the Organisation of Islamic Cooperation.",
    "country_capital": "Paramaribo",
    "country_population": 586634,
    "country_continent": "Americas",
    "country_language": "Dutch",
    "country_currency": "Surinamese dollar ($)",
    "country_flag": "https://flagcdn.com/sr.svg"
  },
  {
    "country_name": "Democratic Republic of the Congo",
    "country_description": "The Democratic Republic of the Congo (DRC), also known as DR Congo, Congo-Kinshasa, or simply Congo, is a country in Central Africa. By land area the country is the second-largest country in Africa and the 11th-largest in the world. With a population of around 110 million, the Democratic Republic of the Congo is the most populous Francophone country in the world. The national capital and largest city is Kinshasa, which is also the economic center. The country is bordered by the Republic of the Congo, Central African Republic, South Sudan, Uganda, Rwanda, Burundi, Tanzania, Zambia, Angola, the Cabinda exclave of Angola, and the South Atlantic Ocean.",
    "country_capital": "Kinshasa",
    "country_population": 108407721,
    "country_continent": "Africa",
    "country_language": "French",
    "country_currency": "Congolese franc (FC)",
    "country_flag": "https://flagcdn.com/cd.svg"
  },
  {
    "country_name": "Somalia",
    "country_description": "Somalia, officially the Federal Republic of Somalia, is the easternmost country in continental Africa. The country is located in the Horn of Africa and is bordered by Ethiopia to the west, Djibouti to the northwest, Kenya to the southwest, the Gulf of Aden to the north, and the Indian Ocean to the east. Somalia has the longest coastline on Africa's mainland. Somalia has an estimated population of 18.1 million, of which 2.7 million live in the capital and largest city, Mogadishu. Around 85% of its residents are ethnic Somalis and the official languages of the country are Somali and Arabic, though the former is the primary language. Somalia has historic and religious ties to the Arab world. As such the people in Somalia are Muslims, the majority of them Sunni.",
    "country_capital": "Mogadishu",
    "country_population": 15893219,
    "country_continent": "Africa",
    "country_language": "Arabic",
    "country_currency": "Somali shilling (Sh)",
    "country_flag": "https://flagcdn.com/so.svg"
  },
  {
    "country_name": "Czechia",
    "country_description": "The Czech Republic, also known as Czechia, and historically known as Bohemia, is a landlocked country in Central Europe. The country is bordered by Austria to the south, Germany to the west, Poland to the northeast, and Slovakia to the southeast. The Czech Republic has a hilly landscape that covers an area of 78,871 square kilometers (30,452 sq mi) with a mostly temperate continental and oceanic climate. The capital and largest city is Prague; other major cities and urban areas include Brno, Ostrava, Plzeň and Liberec.",
    "country_capital": "Prague",
    "country_population": 10698896,
    "country_continent": "Europe",
    "country_language": "Czech",
    "country_currency": "Czech koruna (Kč)",
    "country_flag": "https://flagcdn.com/cz.svg"
  },
  {
    "country_name": "New Caledonia",
    "country_description": "New Caledonia is a group of islands in the southwest Pacific Ocean, 220 km (140 mi) southwest of Vanuatu and 1,210 km (750 mi) east of Australia. Located 16,100 km (10,000 mi) from Metropolitan France, it forms a sui generis collectivity of the French Republic, a legal status unique in overseas France and enshrined in a dedicated chapter of the French Constitution.",
    "country_capital": "Nouméa",
    "country_population": 271960,
    "country_continent": "Oceania",
    "country_language": "French",
    "country_currency": "CFP franc (₣)",
    "country_flag": "https://flagcdn.com/nc.svg"
  },
  {
    "country_name": "Vanuatu",
    "country_description": "Vanuatu, officially the Republic of Vanuatu, is an island country in Melanesia located in the South Pacific Ocean. The archipelago, which is of volcanic origin, is 1,750 km (1,090 mi) east of northern Australia, 540 km (340 mi) northeast of New Caledonia, east of New Guinea, southeast of Solomon Islands, and west of Fiji.",
    "country_capital": "Port Vila",
    "country_population": 307150,
    "country_continent": "Oceania",
    "country_language": "Bislama",
    "country_currency": "Vanuatu vatu (Vt)",
    "country_flag": "https://flagcdn.com/vu.svg"
  },
  {
    "country_name": "Saint Helena, Ascension and Tristan da Cunha",
    "country_description": "Saint Helena, Ascension and Tristan da Cunha is a British Overseas Territory located in the South Atlantic and consisting of the island of Saint Helena, Ascension Island, and the archipelago of Tristan da Cunha. Its name was Saint Helena and Dependencies until 1 September 2009, when a new constitution came into force, giving the three islands equal status as three territories, with a grouping under the Crown.",
    "country_capital": "Jamestown",
    "country_population": 53192,
    "country_continent": "Africa",
    "country_language": "English",
    "country_currency": "Pound sterling (£)",
    "country_flag": "https://flagcdn.com/sh.svg"
  },
  {
    "country_name": "Togo",
    "country_description": "Togo, officially the Togolese Republic, is a country in West Africa. It is bordered by Ghana to the west, Benin to the east and Burkina Faso to the north. It is one of the least developed countries and extends south to the Gulf of Guinea, where its capital, Lomé, is located. It is a small, tropical country, which covers 57,000 square kilometres and has a population of approximately 8 million, and it has a width of less than 115 km (71 mi) between Ghana and its eastern neighbour Benin.",
    "country_capital": "Lomé",
    "country_population": 8278737,
    "country_continent": "Africa",
    "country_language": "French",
    "country_currency": "West African CFA franc (Fr)",
    "country_flag": "https://flagcdn.com/tg.svg"
  },
  {
    "country_name": "British Virgin Islands",
    "country_description": "The British Virgin Islands (BVI), officially the Virgin Islands, are a British Overseas Territory in the Caribbean, to the east of Puerto Rico and the US Virgin Islands and north-west of Anguilla. The islands are geographically part of the Virgin Islands archipelago and are located in the Leeward Islands of the Lesser Antilles and part of the West Indies.",
    "country_capital": "Road Town",
    "country_population": 30237,
    "country_continent": "Americas",
    "country_language": "English",
    "country_currency": "United States dollar ($)",
    "country_flag": "https://flagcdn.com/vg.svg"
  },
  {
    "country_name": "Kenya",
    "country_description": "Kenya, officially the Republic of Kenya, is a country in East Africa. With a population of more than 47.6 million in the 2019 census, Kenya is the 28th-most-populous country in the world and 7th most populous in Africa. Kenya's capital and largest city is Nairobi, while its oldest and second-largest city, is the major port city of Mombasa, situated on Mombasa Island in the Indian Ocean and the surrounding mainland. Mombasa was the capital of the British East Africa Protectorate, which included most of what is now Kenya and southwestern Somalia, from 1889 to 1907. Other important cities include Kisumu and Nakuru. Kenya is bordered by South Sudan to the northwest, Ethiopia to the north, Somalia to the east, Uganda to the west, Tanzania to the south, and the Indian Ocean to the southeast.",
    "country_capital": "Nairobi",
    "country_population": 53771300,
    "country_continent": "Africa",
    "country_language": "English",
    "country_currency": "Kenyan shilling (Sh)",
    "country_flag": "https://flagcdn.com/ke.svg"
  },
  {
    "country_name": "Niue",
    "country_description": "Niue is a self-governing island country in free association with New Zealand. It is situated in the South Pacific Ocean and is part of Polynesia, and predominantly inhabited by Polynesians. One of the world's largest coral islands, Niue is commonly referred to as \"The Rock\", which comes from the traditional name \"Rock of Polynesia\".",
    "country_capital": "Alofi",
    "country_population": 1470,
    "country_continent": "Oceania",
    "country_language": "English",
    "country_currency": "New Zealand dollar ($)",
    "country_flag": "https://flagcdn.com/nu.svg"
  },
  {
    "country_name": "Heard Island and McDonald Islands",
    "country_description": "The Territory of Heard Island and McDonald Islands is an Australian external territory comprising a volcanic group of mostly barren Antarctic islands, about two-thirds of the way from Madagascar to Antarctica. The group's overall land area is 372 km2 (144 sq mi) and it has 101.9 km (63 mi) of coastline. Discovered in the mid-19th century, the islands lie on the Kerguelen Plateau in the Indian Ocean and have been an Australian territory since 1947.",
    "country_population": 0,
    "country_continent": "Antarctic",
    "country_language": "English",
    "country_currency": "No currency data available",
    "country_flag": "https://flagcdn.com/hm.svg"
  },
  {
    "country_name": "Rwanda",
    "country_description": "Rwanda, officially the Republic of Rwanda, is a landlocked country in the Great Rift Valley of East Africa, where the African Great Lakes region and Southeast Africa converge. Located a few degrees south of the Equator, Rwanda is bordered by Uganda, Tanzania, Burundi, and the Democratic Republic of the Congo. It is highly elevated, giving it the sobriquet \"land of a thousand hills\", with its geography dominated by mountains in the west and savanna to the southeast, with numerous lakes throughout the country. The climate is temperate to subtropical, with two rainy seasons and two dry seasons each year. It is the most densely populated mainland African country; among countries larger than 10,000 km2, it is the fifth-most densely populated country in the world. Its capital and largest city is Kigali.",
    "country_capital": "Kigali",
    "country_population": 12952209,
    "country_continent": "Africa",
    "country_language": "English",
    "country_currency": "Rwandan franc (Fr)",
    "country_flag": "https://flagcdn.com/rw.svg"
  },
  {
    "country_name": "Estonia",
    "country_description": "Estonia, officially the Republic of Estonia, is a country by the Baltic Sea in Northern Europe. It is bordered to the north by the Gulf of Finland across from Finland, to the west by the sea across from Sweden, to the south by Latvia, and to the east by Lake Peipus and Russia. The territory of Estonia consists of the mainland, the larger islands of Saaremaa and Hiiumaa, and over 2,300 other islands and islets on the east coast of the Baltic Sea, covering a total area of 45,335 square kilometres (17,504 sq mi). Tallinn and Tartu are the two largest urban areas. The Estonian language is the official language and the first language of the majority of the population of 1.4 million.",
    "country_capital": "Tallinn",
    "country_population": 1331057,
    "country_continent": "Europe",
    "country_language": "Estonian",
    "country_currency": "Euro (€)",
    "country_flag": "https://flagcdn.com/ee.svg"
  },
  {
    "country_name": "Romania",
    "country_description": "Romania is a country located at the crossroads of Central, Eastern and Southeast Europe. It borders Ukraine to the north and east, Hungary to the west, Serbia to the southwest, Bulgaria to the south, Moldova to the east, and the Black Sea to the southeast. It has a mainly continental climate, and an area of 238,397 km2 (92,046 sq mi) with a population of 19 million people. Romania is the twelfth-largest country in Europe and the sixth-most populous member state of the European Union. Europe's second-longest river, the Danube, empties into the Danube Delta in the southeast of the country. The Carpathian Mountains cross Romania from the north to the southwest and include Moldoveanu Peak, at an altitude of 2,544 m (8,346 ft). Bucharest is the country's largest urban area and economic center. Other major urban centers include Cluj-Napoca, Timișoara, Iași, Constanța and Brașov.",
    "country_capital": "Bucharest",
    "country_population": 19286123,
    "country_continent": "Europe",
    "country_language": "Romanian",
    "country_currency": "Romanian leu (lei)",
    "country_flag": "https://flagcdn.com/ro.svg"
  },
  {
    "country_name": "Trinidad and Tobago",
    "country_description": "Trinidad and Tobago, officially the Republic of Trinidad and Tobago, is the southernmost island country in the Caribbean. Consisting of main islands Trinidad and Tobago and numerous much smaller islands, it is situated 11 kilometres northeast off the coast of Venezuela, 130 kilometres south of Grenada, and west of Barbados. The capital is Port of Spain, while its largest and most populous municipality is Chaguanas. Despite its proximity to South America, Trinidad and Tobago is generally considered to be part of the West Indies.",
    "country_capital": "Port of Spain",
    "country_population": 1399491,
    "country_continent": "Americas",
    "country_language": "English",
    "country_currency": "Trinidad and Tobago dollar ($)",
    "country_flag": "https://flagcdn.com/tt.svg"
  },
  {
    "country_name": "Guyana",
    "country_description": "Guyana officially the Co-operative Republic of Guyana, is a country on the northern coast of South America, part of the historic mainland British West Indies. Georgetown is the capital of Guyana and is also the country's largest city. Guyana is bordered by the Atlantic Ocean to the north, Brazil to the south and southwest, Venezuela to the west, and Suriname to the east. With a land area of 214,969 km2 (83,000 sq mi), Guyana is the third-smallest sovereign state by area in mainland South America after Uruguay and Suriname, and is the second-least populous sovereign state in South America after Suriname; it is also one of the least densely populated countries on Earth. The official language of the country is English, although a large part of the population is bilingual in English and the indigenous languages. It has a wide variety of natural habitats and very high biodiversity. The country also hosts a part of the Amazon rainforest, the largest tropical rainforest in the world.",
    "country_capital": "Georgetown",
    "country_population": 786559,
    "country_continent": "Americas",
    "country_language": "English",
    "country_currency": "Guyanese dollar ($)",
    "country_flag": "https://flagcdn.com/gy.svg"
  },
  {
    "country_name": "Timor-Leste",
    "country_description": "East Timor, also known as Timor-Leste, officially the Democratic Republic of Timor-Leste, is a country in Southeast Asia. It comprises the eastern half of the island of Timor, the exclave of Oecusse on the island's north-western half, and the minor islands of Atauro and Jaco. The western half of the island of Timor is administered by Indonesia. Australia is the country's southern neighbour, separated by the Timor Sea. The country's size is 14,950 square kilometres (5,770 sq mi). Dili, on the north coast of Timor, is its capital and largest city.",
    "country_capital": "Dili",
    "country_population": 1318442,
    "country_continent": "Asia",
    "country_language": "Portuguese",
    "country_currency": "United States dollar ($)",
    "country_flag": "https://flagcdn.com/tl.svg"
  },
  {
    "country_name": "Vietnam",
    "country_description": "Vietnam, officially the Socialist Republic of Viet Nam, is a country at the eastern edge of mainland Southeast Asia, with an area of about 331,000 square kilometres (128,000 sq mi) and a population of over 100 million, making it the world's fifteenth-most populous country. One of the two Marxist–Leninist states in Southeast Asia, Vietnam shares land borders with China to the north, and Laos and Cambodia to the west. It shares maritime borders with Thailand through the Gulf of Thailand, and the Philippines, Indonesia, and Malaysia through the South China Sea. Its capital is Hanoi and its largest city is Ho Chi Minh City.",
    "country_capital": "Hanoi",
    "country_population": 97338583,
    "country_continent": "Asia",
    "country_language": "Vietnamese",
    "country_currency": "Vietnamese đồng (₫)",
    "country_flag": "https://flagcdn.com/vn.svg"
  },
  {
    "country_name": "Uruguay",
    "country_description": "Uruguay, officially the Oriental Republic of Uruguay, is a country in South America. It shares borders with Argentina to its west and southwest and Brazil to its north and northeast, while bordering the Río de la Plata to the south and the Atlantic Ocean to the southeast. It is part of the Southern Cone region of South America. Uruguay covers an area of approximately 176,215 square kilometres (68,037 sq mi). It has a population of around 3.4 million, of whom nearly 2 million live in the metropolitan area of its capital and largest city, Montevideo.",
    "country_capital": "Montevideo",
    "country_population": 3473727,
    "country_continent": "Americas",
    "country_language": "Spanish",
    "country_currency": "Uruguayan peso ($)",
    "country_flag": "https://flagcdn.com/uy.svg"
  },
  {
    "country_name": "Vatican City",
    "country_description": "Vatican City, officially the Vatican City State, is a landlocked sovereign country, city-state, microstate, and enclave surrounded by, and historically a part of, Rome, Italy. It became independent from Italy in 1929 with the Lateran Treaty, and is a distinct territory under \"full ownership, exclusive dominion, and sovereign authority and jurisdiction\" of the Holy See, which is itself a sovereign entity under international law, maintaining the city-state's temporal power, governance, diplomatic, and spiritual independence. The Vatican is also a metonym for the pope, the Holy See, and the Roman Curia.",
    "country_capital": "Vatican City",
    "country_population": 451,
    "country_continent": "Europe",
    "country_language": "Italian",
    "country_currency": "Euro (€)",
    "country_flag": "https://flagcdn.com/va.svg"
  },
  {
    "country_name": "Hong Kong",
    "country_description": "Hong Kong is a special administrative region of China. With 7.4 million residents of various nationalities in a 1,104-square-kilometre (426 sq mi) territory, Hong Kong is the fourth most densely populated region in the world.",
    "country_capital": "City of Victoria",
    "country_population": 7500700,
    "country_continent": "Asia",
    "country_language": "English",
    "country_currency": "Hong Kong dollar ($)",
    "country_flag": "https://flagcdn.com/hk.svg"
  },
  {
    "country_name": "Austria",
    "country_description": "Austria, formally the Republic of Austria, is a landlocked country in Central Europe, lying in the Eastern Alps. It is a federation of nine states, one of which is the capital, Vienna, the most populous city and state. Austria is bordered by Germany to the northwest, the Czech Republic to the north, Slovakia to the northeast, Hungary to the east, Slovenia and Italy to the south, and Switzerland and Liechtenstein to the west. The country occupies an area of 83,879 km2 (32,386 sq mi) and has a population of around 9 million.",
    "country_capital": "Vienna",
    "country_population": 8917205,
    "country_continent": "Europe",
    "country_language": "German",
    "country_currency": "Euro (€)",
    "country_flag": "https://flagcdn.com/at.svg"
  },
  {
    "country_name": "Antigua and Barbuda",
    "country_description": "Antigua and Barbuda is a sovereign archipelagic country in the Caribbean. It lies at the conjuncture of the Caribbean Sea and the Atlantic Ocean in the Leeward Islands part of the Lesser Antilles.",
    "country_capital": "Saint John's",
    "country_population": 97928,
    "country_continent": "Americas",
    "country_language": "English",
    "country_currency": "Eastern Caribbean dollar ($)",
    "country_flag": "https://flagcdn.com/ag.svg"
  },
  {
    "country_name": "Turkmenistan",
    "country_description": "Turkmenistan is a landlocked country in Central Asia bordered by Kazakhstan to the northwest, Uzbekistan to the north, east and northeast, Afghanistan to the southeast, Iran to the south and southwest and the Caspian Sea to the west. Ashgabat is the capital and largest city. It is one of the six independent Turkic states. With a population over 7 million, Turkmenistan is the 35th most-populous country in Asia and has the lowest population of the Central Asian republics while being one of the most sparsely populated nations on the Asian continent.",
    "country_capital": "Ashgabat",
    "country_population": 6031187,
    "country_continent": "Asia",
    "country_language": "Russian",
    "country_currency": "Turkmenistan manat (m)",
    "country_flag": "https://flagcdn.com/tm.svg"
  },
  {
    "country_name": "Mozambique",
    "country_description": "Mozambique, officially the Republic of Mozambique, is a country located in southeast Africa bordered by the Indian Ocean to the east, Tanzania to the north, Malawi and Zambia to the northwest, Zimbabwe to the west, and Eswatini and South Africa to the south and southwest. The sovereign state is separated from the Comoros, Mayotte and Madagascar by the Mozambique Channel to the east. The capital and largest city is Maputo.",
    "country_capital": "Maputo",
    "country_population": 31255435,
    "country_continent": "Africa",
    "country_language": "Portuguese",
    "country_currency": "Mozambican metical (MT)",
    "country_flag": "https://flagcdn.com/mz.svg"
  },
  {
    "country_name": "Panama",
    "country_description": "Panama, officially the Republic of Panama, is a country in Latin America at the southern end of Central America, bordering South America. It is bordered by Costa Rica to the west, Colombia to the southeast, the Caribbean Sea to the north, and the Pacific Ocean to the south. Its capital and largest city is Panama City, whose metropolitan area is home to nearly half of the country's over 4 million inhabitants.",
    "country_capital": "Panama City",
    "country_population": 4314768,
    "country_continent": "Americas",
    "country_language": "Spanish",
    "country_currency": "Panamanian balboa (B/.)",
    "country_flag": "https://flagcdn.com/pa.svg"
  },
  {
    "country_name": "Micronesia",
    "country_description": "Micronesia is a subregion of Oceania, consisting of approximately 2,000 small islands in the Northwestern Pacific Ocean. It has a close shared cultural history with three other island regions: Maritime Southeast Asia to the west, Polynesia to the east, and Melanesia to the south—as well as with the wider community of Austronesian peoples.",
    "country_capital": "Palikir",
    "country_population": 115021,
    "country_continent": "Oceania",
    "country_language": "English",
    "country_currency": "United States dollar ($)",
    "country_flag": "https://flagcdn.com/fm.svg"
  },
  {
    "country_name": "Ireland",
    "country_description": "Ireland is an island in the North Atlantic Ocean, in north-western Europe. It is separated from Great Britain to its east by the North Channel, the Irish Sea, and St George's Channel. Ireland is the second-largest island of the British Isles, the third-largest in Europe, and the twentieth-largest in the world. Geopolitically, the island is divided between the Republic of Ireland, a sovereign state covering five-sixths of the island, and Northern Ireland, which is part of the United Kingdom. As of 2022, the population of the entire island is just over 7 million, with 5.1 million in the Republic of Ireland and 1.9 million in Northern Ireland, ranking it the second-most populous island in Europe after Great Britain.",
    "country_capital": "Dublin",
    "country_population": 4994724,
    "country_continent": "Europe",
    "country_language": "English",
    "country_currency": "Euro (€)",
    "country_flag": "https://flagcdn.com/ie.svg"
  },
  {
    "country_name": "Curaçao",
    "country_description": "Curaçao, officially the Country of Curaçao, is a Lesser Antilles island in the southern Caribbean Sea, specifically the Dutch Caribbean region, about 65 km (40 mi) north of Venezuela. It is a constituent country of the Kingdom of the Netherlands.",
    "country_capital": "Willemstad",
    "country_population": 155014,
    "country_continent": "Americas",
    "country_language": "English",
    "country_currency": "Netherlands Antillean guilder (ƒ)",
    "country_flag": "https://flagcdn.com/cw.svg"
  },
  {
    "country_name": "French Guiana",
    "country_description": "French Guiana is an overseas department and region of France located on the northern coast of South America in the Guianas and the West Indies. Bordered by Suriname to the west and Brazil to the east and south, French Guiana covers a total area of 84,000 km2 (32,000 sq mi) and a land area of 83,534 km2 (32,253 sq mi).As of January 2024, it is home to approximately 295,385 people.",
    "country_capital": "Cayenne",
    "country_population": 254541,
    "country_continent": "Americas",
    "country_language": "French",
    "country_currency": "Euro (€)",
    "country_flag": "https://flagcdn.com/gf.svg"
  },
  {
    "country_name": "Norway",
    "country_description": "Norway, officially the Kingdom of Norway, is a Nordic country in Northern Europe, situated on the Scandinavian Peninsula with a population of 5.5 million as of 2024. The remote Arctic island of Jan Mayen and the archipelago of Svalbard also form part of the Kingdom of Norway. Bouvet Island, located in the Subantarctic, is a dependency, and not a part of the Kingdom; Norway also claims the Antarctic territories of Peter I Island and Queen Maud Land. The capital and largest city in Norway is Oslo.",
    "country_capital": "Oslo",
    "country_population": 5379475,
    "country_continent": "Europe",
    "country_language": "Norwegian Nynorsk",
    "country_currency": "Norwegian krone (kr)",
    "country_flag": "https://flagcdn.com/no.svg"
  },
  {
    "country_name": "Åland Islands",
    "country_description": "Åland is an autonomous and demilitarised region of Finland. Receiving its autonomy by a 1920 decision of the League of Nations, it is the smallest region of Finland by both area (1,580 km2) and population (30,129), constituting 0.51% of Finland's land area and 0.54% of its population. Its only official language is Swedish and the capital city is Mariehamn.",
    "country_capital": "Mariehamn",
    "country_population": 29458,
    "country_continent": "Europe",
    "country_language": "Swedish",
    "country_currency": "Euro (€)",
    "country_flag": "https://flagcdn.com/ax.svg"
  },
  {
    "country_name": "Central African Republic",
    "country_description": "The Central African Republic (CAR), formerly known as Ubangi-Shari, is a landlocked country in Central Africa. It is bordered by Chad to the north, Sudan to the northeast, South Sudan to the east, the Democratic Republic of the Congo to the south, the Republic of the Congo to the southwest, and Cameroon to the west. Bangui is the country's capital and largest city, bordering the Democratic Republic of the Congo. The Central African Republic covers a land area of about 620,000 square kilometres (240,000 sq mi). As of 2024, it has a population of 5,357,744, and is in the scene of a civil war, which has been ongoing since 2012. As a former French colony, French is the official language, with Sango, a Ngbandi based-creole language as the national and co-official language.",
    "country_capital": "Bangui",
    "country_population": 4829764,
    "country_continent": "Africa",
    "country_language": "French",
    "country_currency": "Central African CFA franc (Fr)",
    "country_flag": "https://flagcdn.com/cf.svg"
  },
  {
    "country_name": "Burkina Faso",
    "country_description": "Burkina Faso is a landlocked country in West Africa, bordered by Mali to the northwest, Niger to the northeast, Benin to the southeast, Togo and Ghana to the south, and Ivory Coast to the southwest. It covers an area of 274,223 km2. In 2021, the country had an estimated population of approximately 23,674,480. Previously called the Republic of Upper Volta (1958–1984), it was renamed Burkina Faso by former president Thomas Sankara. Its citizens are known as Burkinabè, and its capital and largest city is Ouagadougou.",
    "country_capital": "Ouagadougou",
    "country_population": 20903278,
    "country_continent": "Africa",
    "country_language": "French",
    "country_currency": "West African CFA franc (Fr)",
    "country_flag": "https://flagcdn.com/bf.svg"
  },
  {
    "country_name": "Eritrea",
    "country_description": "Eritrea, officially the State of Eritrea, is a country in the Horn of Africa region of Eastern Africa, with its capital and largest city being Asmara. It is bordered by Ethiopia in the south, Sudan in the west, and Djibouti in the southeast. The northeastern and eastern parts of Eritrea have an extensive coastline along the Red Sea. The nation has a total area of approximately 117,600 km2 (45,406 sq mi), and includes the Dahlak Archipelago and several of the Hanish Islands.",
    "country_capital": "Asmara",
    "country_population": 5352000,
    "country_continent": "Africa",
    "country_language": "Arabic",
    "country_currency": "Eritrean nakfa (Nfk)",
    "country_flag": "https://flagcdn.com/er.svg"
  },
  {
    "country_name": "Tanzania",
    "country_description": "Tanzania, officially the United Republic of Tanzania, is a country in East Africa within the African Great Lakes region. It is bordered by Uganda to the northwest; Kenya to the northeast; the Indian Ocean to the east; Mozambique and Malawi to the south; Zambia to the southwest; and Rwanda, Burundi, and the Democratic Republic of the Congo to the west. According to the 2022 national census, Tanzania has a population of around 62 million, making it the most populous country located entirely south of the equator.",
    "country_capital": "Dodoma",
    "country_population": 59734213,
    "country_continent": "Africa",
    "country_language": "English",
    "country_currency": "Tanzanian shilling (Sh)",
    "country_flag": "https://flagcdn.com/tz.svg"
  },
  {
    "country_name": "South Korea",
    "country_description": "South Korea, officially the Republic of Korea (ROK), is a country in East Asia. It constitutes the southern half of the Korean Peninsula and borders North Korea along the Korean Demilitarized Zone; though it also claims the land border with China and Russia. The country's western border is formed by the Yellow Sea, while its eastern border is defined by the Sea of Japan. South Korea claims to be the sole legitimate government of the entire peninsula and adjacent islands. It has a population of 51.96 million, of which half live in the Seoul Capital Area, the ninth most populous metropolitan area in the world. Other major cities include Busan, Daegu, and Incheon.",
    "country_capital": "Seoul",
    "country_population": 51780579,
    "country_continent": "Asia",
    "country_language": "Korean",
    "country_currency": "South Korean won (₩)",
    "country_flag": "https://flagcdn.com/kr.svg"
  },
  {
    "country_name": "Jordan",
    "country_description": "Jordan, officially the Hashemite Kingdom of Jordan, is a country in the Southern Levant region of West Asia. Jordan is bordered by Syria to the north, Iraq to the east, Saudi Arabia to the south, and Israel and the occupied Palestinian territories to the west. The Jordan River, flowing into the Dead Sea, is located along the country's western border within the Jordan Rift Valley. Jordan has a small coastline along the Red Sea in its southwest, separated by the Gulf of Aqaba from Egypt. Amman is the country's capital and largest city, as well as the most populous city in the Levant.",
    "country_capital": "Amman",
    "country_population": 10203140,
    "country_continent": "Asia",
    "country_language": "Arabic",
    "country_currency": "Jordanian dinar (د.ا)",
    "country_flag": "https://flagcdn.com/jo.svg"
  },
  {
    "country_name": "Mauritania",
    "country_description": "Mauritania, formally the Islamic Republic of Mauritania, is a sovereign country in Northwest Africa. It is bordered by the Atlantic Ocean to the west, Western Sahara to the north and northwest, Algeria to the northeast, Mali to the east and southeast, and Senegal to the southwest. By land area Mauritania is the 11th-largest country in Africa and 28th-largest in the world; 90% of its territory is in the Sahara. Most of its population of some 4.3 million lives in the temperate south of the country, with roughly a third concentrated in the capital and largest city, Nouakchott, on the Atlantic coast.",
    "country_capital": "Nouakchott",
    "country_population": 4649660,
    "country_continent": "Africa",
    "country_language": "Arabic",
    "country_currency": "Mauritanian ouguiya (UM)",
    "country_flag": "https://flagcdn.com/mr.svg"
  },
  {
    "country_name": "Lithuania",
    "country_description": "Lithuania, officially the Republic of Lithuania, is a country in the Baltic region of Europe. It is one of three Baltic states and lies on the eastern shore of the Baltic Sea, bordered by Latvia to the north, Belarus to the east and south, Poland to the south, and the Russian semi-exclave of Kaliningrad Oblast to the southwest, with a maritime border with Sweden to the west. Lithuania covers an area of 65,300 km2 (25,200 sq mi), with a population of 2.88 million. Its capital and largest city is Vilnius; other major cities include Kaunas, Klaipėda, Šiauliai and Panevėžys. Lithuanians belong to the linguistic group of the Balts and speak Lithuanian.",
    "country_capital": "Vilnius",
    "country_population": 2794700,
    "country_continent": "Europe",
    "country_language": "Lithuanian",
    "country_currency": "Euro (€)",
    "country_flag": "https://flagcdn.com/lt.svg"
  },
  {
    "country_name": "United States Minor Outlying Islands",
    "country_description": "The United States Minor Outlying Islands is a statistical designation defined by the International Organization for Standardization's ISO 3166-1 code. The entry code is ISO 3166-2:UM. The minor outlying islands and groups of islands comprise eight United States insular areas in the Pacific Ocean and one in the Caribbean Sea.",
    "country_capital": "Washington DC",
    "country_population": 300,
    "country_continent": "Americas",
    "country_language": "English",
    "country_currency": "United States dollar ($)",
    "country_flag": "https://flagcdn.com/um.svg"
  },
  {
    "country_name": "Slovakia",
    "country_description": "Slovakia, officially the Slovak Republic, is a landlocked country in Central Europe. It is bordered by Poland to the north, Ukraine to the east, Hungary to the south, Austria to the west, and the Czech Republic to the northwest. Slovakia's mostly mountainous territory spans about 49,000 square kilometres (19,000 sq mi), hosting a population exceeding 5.4 million. The capital and largest city is Bratislava, while the second largest city is Košice.",
    "country_capital": "Bratislava",
    "country_population": 5458827,
    "country_continent": "Europe",
    "country_language": "Slovak",
    "country_currency": "Euro (€)",
    "country_flag": "https://flagcdn.com/sk.svg"
  },
  {
    "country_name": "Angola",
    "country_description": "Angola, officially the Republic of Angola, is a country on the west-central coast of Southern Africa. It is the second-largest Lusophone (Portuguese-speaking) country in both total area and population and is the seventh-largest country in Africa. It is bordered by Namibia to the south, the Democratic Republic of the Congo to the north, Zambia to the east, and the Atlantic Ocean to the west. Angola has an exclave province, the province of Cabinda, that borders the Republic of the Congo and the Democratic Republic of the Congo. The capital and most populous city is Luanda.",
    "country_capital": "Luanda",
    "country_population": 32866268,
    "country_continent": "Africa",
    "country_language": "Portuguese",
    "country_currency": "Angolan kwanza (Kz)",
    "country_flag": "https://flagcdn.com/ao.svg"
  },
  {
    "country_name": "Kazakhstan",
    "country_description": "Kazakhstan, officially the Republic of Kazakhstan, is a landlocked country primarily in Central Asia, with a small portion of its territory in Eastern Europe. It borders Russia to the north and west, China to the east, Kyrgyzstan to the southeast, Uzbekistan to the south, and Turkmenistan to the southwest, with a coastline along the Caspian Sea. Its capital is Astana, while the largest city and leading cultural and commercial hub is Almaty. Kazakhstan is the world's ninth-largest country by land area and the largest landlocked country. It has a population of 20 million and one of the lowest population densities in the world, at fewer than 6 people per square kilometre. Ethnic Kazakhs constitute a majority, while ethnic Russians form a significant minority. Officially secular, Kazakhstan is a Muslim-majority country with a sizeable Christian community.",
    "country_capital": "Nur-Sultan",
    "country_population": 18754440,
    "country_continent": "Asia",
    "country_language": "Kazakh",
    "country_currency": "Kazakhstani tenge (₸)",
    "country_flag": "https://flagcdn.com/kz.svg"
  },
  {
    "country_name": "Moldova",
    "country_description": "Moldova, officially the Republic of Moldova, is a landlocked country in Eastern Europe, on the northeastern corner of the Balkans. The country spans a total of 33,483 km2 (12,928 sq mi) and has a population of approximately 2.42 million as of January 2024. Moldova is bordered by Romania to the west and Ukraine to the north, east, and south. The unrecognised breakaway state of Transnistria lies across the Dniester river on the country's eastern border with Ukraine. Moldova is a unitary parliamentary representative democratic republic with its capital in Chișinău, the country's largest city and main cultural and commercial centre.",
    "country_capital": "Chișinău",
    "country_population": 2617820,
    "country_continent": "Europe",
    "country_language": "Romanian",
    "country_currency": "Moldovan leu (L)",
    "country_flag": "https://flagcdn.com/md.svg"
  },
  {
    "country_name": "Mali",
    "country_description": "Mali, officially the Republic of Mali, is a landlocked country in West Africa. It is the eighth-largest country in Africa, with an area of over 1,240,192 square kilometres (478,841 sq mi). The country is bordered to the north by Algeria, to the east by Niger, to the northwest by Mauritania, to the south by Burkina Faso and Ivory Coast, and to the west by Guinea and Senegal. The population of Mali is 24,478,595, 47.19% of which are estimated to be under the age of 15 in 2024. Its capital and largest city is Bamako. The country has 13 official languages, of which Bambara is the most commonly spoken.",
    "country_capital": "Bamako",
    "country_population": 20250834,
    "country_continent": "Africa",
    "country_language": "French",
    "country_currency": "West African CFA franc (Fr)",
    "country_flag": "https://flagcdn.com/ml.svg"
  },
  {
    "country_name": "Falkland Islands",
    "country_description": "The Falkland Islands is an archipelago in the South Atlantic Ocean on the Patagonian Shelf. The principal islands are about 300 mi (480 km) east of South America's southern Patagonian coast and about 752 mi (1,210 km) from Cape Dubouzet at the northern tip of the Antarctic Peninsula, at a latitude of about 52°S. The archipelago, with an area of 4,700 sq mi (12,000 km2), comprises East Falkland, West Falkland, and 776 smaller islands. As a British overseas territory, the Falklands have internal self-governance, but the United Kingdom takes responsibility for their defence and foreign affairs. The capital and largest settlement is Stanley on East Falkland.",
    "country_capital": "Stanley",
    "country_population": 2563,
    "country_continent": "Americas",
    "country_language": "English",
    "country_currency": "Falkland Islands pound (£)",
    "country_flag": "https://flagcdn.com/fk.svg"
  },
  {
    "country_name": "Armenia",
    "country_description": "Armenia, officially the Republic of Armenia, is a landlocked country in the Armenian Highlands of West Asia. It is a part of the Caucasus region and is bordered by Turkey to the west, Georgia to the north and Azerbaijan to the east, and Iran and the Azerbaijani exclave of Nakhchivan to the south. Yerevan is the capital, largest city and financial center.",
    "country_capital": "Yerevan",
    "country_population": 2963234,
    "country_continent": "Asia",
    "country_language": "Armenian",
    "country_currency": "Armenian dram (֏)",
    "country_flag": "https://flagcdn.com/am.svg"
  },
  {
    "country_name": "Samoa",
    "country_description": "Samoa, officially the Independent State of Samoa and known until 1997 as Western Samoa, is an island country in Polynesia, consisting of two main islands ; two smaller, inhabited islands ; and several smaller, uninhabited islands, including the Aleipata Islands. Samoa is located 64 km west of American Samoa, 889 km northeast of Tonga, 1,152 km northeast of Fiji, 483 km east of Wallis and Futuna, 1,151 km southeast of Tuvalu, 519 km south of Tokelau, 4,190 km southwest of Hawaii, and 610 km northwest of Niue. The capital and largest city is Apia. The Lapita people discovered and settled the Samoan Islands around 3,500 years ago. They developed a Samoan language and Samoan cultural identity.",
    "country_capital": "Apia",
    "country_population": 198410,
    "country_continent": "Oceania",
    "country_language": "English",
    "country_currency": "Samoan tālā (T)",
    "country_flag": "https://flagcdn.com/ws.svg"
  },
  {
    "country_name": "Jersey",
    "country_description": "Jersey, officially the Bailiwick of Jersey, is an island country in Northwestern Europe and a self-governing British Crown Dependency near the coast of north-west France. It is the largest of the Channel Islands and is 14 miles (23 km) from the Cotentin Peninsula in Normandy. The Bailiwick consists of the main island of Jersey and some surrounding uninhabited islands and rocks including Les Dirouilles, Les Écréhous, Les Minquiers, and Les Pierres de Lecq.",
    "country_capital": "Saint Helier",
    "country_population": 100800,
    "country_continent": "Europe",
    "country_language": "English",
    "country_currency": "British pound (£)",
    "country_flag": "https://flagcdn.com/je.svg"
  },
  {
    "country_name": "Japan",
    "country_description": "Japan is an island country in East Asia. Located in the Pacific Ocean off the northeast coast of the Asian mainland, it is bordered on the west by the Sea of Japan and extends from the Sea of Okhotsk in the north to the East China Sea in the south. The Japanese archipelago consists of four major islands—Hokkaido, Honshu, Shikoku, and Kyushu—and thousands of smaller islands, covering 377,975 square kilometres (145,937 sq mi). Japan has a population of nearly 124 million as of 2024, making it the eleventh-most populous country.",
    "country_capital": "Tokyo",
    "country_population": 125836021,
    "country_continent": "Asia",
    "country_language": "Japanese",
    "country_currency": "Japanese yen (¥)",
    "country_flag": "https://flagcdn.com/jp.svg"
  },
  {
    "country_name": "Bolivia",
    "country_description": "Bolivia, officially the Plurinational State of Bolivia, is a landlocked country located in central South America. It is a country with the largest geographic extension of Amazonian plains and lowlands, mountains and Chaco with a tropical climate, valleys with a warm climate, as well as being part of the Andes of South America and its high plateau areas with cold climates, hills and snow-capped mountains, with a wide biome in each city and region. It includes part of the Pantanal, the largest tropical wetland in the world, along its eastern border. It is bordered by Brazil to the north and east, Paraguay to the southeast, Argentina to the south, Chile to the southwest, and Peru to the west. The seat of government is La Paz, which contains the executive, legislative, and electoral branches of government, while the constitutional capital is Sucre, the seat of the judiciary. The largest city and principal industrial center is Santa Cruz de la Sierra, located on the Llanos Orientales, a mostly flat region in the east of the country with a diverse non-Andean culture.",
    "country_capital": "Sucre",
    "country_population": 11673029,
    "country_continent": "Americas",
    "country_language": "Aymara",
    "country_currency": "Bolivian boliviano (Bs.)",
    "country_flag": "https://flagcdn.com/bo.svg"
  },
  {
    "country_name": "Chile",
    "country_description": "Chile officially the Republic of Chile, is a country in western South America. It is the southernmost country in the world and the closest to Antarctica, stretching along a narrow strip of land between the Andes Mountains and the Pacific Ocean. Chile had a population of 17.5 million as of the latest census in 2017 and has a territorial area of 756,102 square kilometers (291,933 sq mi), sharing borders with Peru to the north, Bolivia to the northeast, Argentina to the east, and the Drake Passage to the south. The country also controls several Pacific islands, including Juan Fernández, Isla Salas y Gómez, Desventuradas, and Easter Island, and claims about 1,250,000 square kilometers (480,000 sq mi) of Antarctica as the Chilean Antarctic Territory. The capital and largest city of Chile is Santiago, and the national language is Spanish.",
    "country_capital": "Santiago",
    "country_population": 19116209,
    "country_continent": "Americas",
    "country_language": "Spanish",
    "country_currency": "Chilean peso ($)",
    "country_flag": "https://flagcdn.com/cl.svg"
  },
  {
    "country_name": "United States of America",
    "country_description": "The United States of America (USA), commonly known as the United States (U.S.) or America, is a country primarily located in North America. It is a federal union of 50 states and a federal capital district, Washington, D.C. The 48 contiguous states border Canada to the north and Mexico to the south, with the states of Alaska to the northwest and the archipelagic Hawaii in the Pacific Ocean. The United States also asserts sovereignty over five major island territories and various uninhabited islands. The country has the world's third-largest land area, largest exclusive economic zone, and third-largest population, exceeding 334 million. Its three largest metropolitan areas are New York, Los Angeles, and Chicago, and its three most populous states are California, Texas, and Florida.",
    "country_capital": "Washington, D.C.",
    "country_population": 329484123,
    "country_continent": "Americas",
    "country_language": "English",
    "country_currency": "United States dollar ($)",
    "country_flag": "https://flagcdn.com/us.svg"
  },
  {
    "country_name": "Saint Vincent and the Grenadines",
    "country_description": "Saint Vincent and the Grenadines, sometimes known simply as Saint Vincent or SVG, is an island country in the eastern Caribbean. It is located in the southeast Windward Islands of the Lesser Antilles, which lie in the West Indies, at the southern end of the eastern border between the Caribbean Sea and the Atlantic Ocean. To the north lies Saint Lucia, to the east is Barbados, and Grenada lies to the south.",
    "country_capital": "Kingstown",
    "country_population": 110947,
    "country_continent": "Americas",
    "country_language": "English",
    "country_currency": "Eastern Caribbean dollar ($)",
    "country_flag": "https://flagcdn.com/vc.svg"
  },
  {
    "country_name": "Bermuda",
    "country_description": "Bermuda is a British Overseas Territory in the North Atlantic Ocean. The closest land outside the territory is in the American state of North Carolina, about 1,035 km (643 mi) to the west-northwest.",
    "country_capital": "Hamilton",
    "country_population": 63903,
    "country_continent": "Americas",
    "country_language": "English",
    "country_currency": "Bermudian dollar ($)",
    "country_flag": "https://flagcdn.com/bm.svg"
  },
  {
    "country_name": "Seychelles",
    "country_description": "Seychelles, officially the Republic of Seychelles, is an island country and archipelagic state consisting of 155 islands in the Indian Ocean. Its capital and largest city, Victoria, is 1,500 kilometres east of mainland Africa. Nearby island countries and territories include the Comoros, Madagascar, Mauritius, and the French overseas departments of Mayotte and Réunion to the south; and the Chagos Archipelago to the east.\nSeychelles is the smallest country in Africa as well as the least populated sovereign African country, with an estimated population of 100,600 in 2022.",
    "country_capital": "Victoria",
    "country_population": 98462,
    "country_continent": "Africa",
    "country_language": "Seychellois Creole",
    "country_currency": "Seychellois rupee (₨)",
    "country_flag": "https://flagcdn.com/sc.svg"
  },
  {
    "country_name": "British Indian Ocean Territory",
    "country_description": "The British Indian Ocean Territory (BIOT) is an Overseas Territory of the United Kingdom situated in the Indian Ocean, halfway between Tanzania and Indonesia. The territory comprises the seven atolls of the Chagos Archipelago with over 1,000 individual islands, many very small, amounting to a total land area of 60 square kilometres. The largest and most southerly island is Diego Garcia, 27 square kilometres, the site of a Joint Military Facility of the United Kingdom and the United States. Official administration is remote from London, though the local capital is often regarded as being on Diego Garcia.",
    "country_capital": "Diego Garcia",
    "country_population": 3000,
    "country_continent": "Africa",
    "country_language": "English",
    "country_currency": "United States dollar ($)",
    "country_flag": "https://flagcdn.com/io.svg"
  },
  {
    "country_name": "Guatemala",
    "country_description": "Guatemala, officially the Republic of Guatemala, is a country in Central America. It is bordered to the north and west by Mexico, to the northeast by Belize, to the east by Honduras, and to the southeast by El Salvador. It is hydrologically bordered to the south by the Pacific Ocean and to the northeast by the Gulf of Honduras.",
    "country_capital": "Guatemala City",
    "country_population": 16858333,
    "country_continent": "Americas",
    "country_language": "Spanish",
    "country_currency": "Guatemalan quetzal (Q)",
    "country_flag": "https://flagcdn.com/gt.svg"
  },
  {
    "country_name": "Ecuador",
    "country_description": "Ecuador, officially the Republic of Ecuador, is a country in northwestern South America, bordered by Colombia on the north, Peru on the east and south, and the Pacific Ocean on the west. It also includes the Galápagos Islands in the Pacific, about 1,000 kilometers (621 mi) west of the mainland. The country's capital is Quito and its largest city is Guayaquil.",
    "country_capital": "Quito",
    "country_population": 17643060,
    "country_continent": "Americas",
    "country_language": "Spanish",
    "country_currency": "United States dollar ($)",
    "country_flag": "https://flagcdn.com/ec.svg"
  },
  {
    "country_name": "Martinique",
    "country_description": "Martinique is an island in the Lesser Antilles of the West Indies, in the eastern Caribbean Sea. A part of the French West Indies (Antilles), Martinique is an overseas department and region and a single territorial collectivity of the French Republic. It is a part of the European Union as an outermost region within the special territories of members of the European Economic Area, and an associate member of the CARICOM, but is not part of the Schengen Area or the European Union Customs Union. The currency in use is the euro.",
    "country_capital": "Fort-de-France",
    "country_population": 378243,
    "country_continent": "Americas",
    "country_language": "French",
    "country_currency": "Euro (€)",
    "country_flag": "https://flagcdn.com/mq.svg"
  },
  {
    "country_name": "Tajikistan",
    "country_description": "Tajikistan, officially the Republic of Tajikistan, is a landlocked country in Central Asia. Dushanbe is the capital and most populous city. Tajikistan is bordered by Afghanistan to the south, Uzbekistan to the west, Kyrgyzstan to the north, and China to the east. It is separated from Pakistan by Afghanistan's Wakhan Corridor. It has a population of approximately 10.6 million people.",
    "country_capital": "Dushanbe",
    "country_population": 9537642,
    "country_continent": "Asia",
    "country_language": "Russian",
    "country_currency": "Tajikistani somoni (ЅМ)",
    "country_flag": "https://flagcdn.com/tj.svg"
  },
  {
    "country_name": "Malta",
    "country_description": "Malta, officially the Republic of Malta, is an island country in Southern Europe located in the Mediterranean Sea, between Sicily and North Africa. It consists of an archipelago 80 km (50 mi) south of Italy, 284 km (176 mi) east of Tunisia, and 333 km (207 mi) north of Libya. The two official languages are Maltese and English. The country's capital is Valletta, which is the smallest capital city in the EU by both area and population. It was also the first World Heritage City in Europe to become a European Capital of Culture in 2018.",
    "country_capital": "Valletta",
    "country_population": 525285,
    "country_continent": "Europe",
    "country_language": "English",
    "country_currency": "Euro (€)",
    "country_flag": "https://flagcdn.com/mt.svg"
  },
  {
    "country_name": "Gambia",
    "country_description": "The Gambia, officially the Republic of The Gambia, is a country in West Africa. Geographically, The Gambia is the smallest country in continental Africa; it is surrounded by Senegal on all sides except for the western part, which is bordered by the Atlantic Ocean.",
    "country_capital": "Banjul",
    "country_population": 2416664,
    "country_continent": "Africa",
    "country_language": "English",
    "country_currency": "dalasi (D)",
    "country_flag": "https://flagcdn.com/gm.svg"
  },
  {
    "country_name": "Nigeria",
    "country_description": "Nigeria, officially the Federal Republic of Nigeria, is a country in West Africa. It is situated between the Sahel to the north and the Gulf of Guinea to the south in the Atlantic Ocean. It covers an area of 923,769 square kilometres (356,669 sq mi). With a population of more than 230 million, it is the most populous country in Africa, and the world's sixth-most populous country. Nigeria borders Niger in the north, Chad in the northeast, Cameroon in the east, and Benin in the west. Nigeria is a federal republic comprising 36 states and the Federal Capital Territory, where its capital, Abuja, is located. The largest city in Nigeria is Lagos, one of the largest metropolitan areas in the world and the largest in Africa.",
    "country_capital": "Abuja",
    "country_population": 206139587,
    "country_continent": "Africa",
    "country_language": "English",
    "country_currency": "Nigerian naira (₦)",
    "country_flag": "https://flagcdn.com/ng.svg"
  },
  {
    "country_name": "Bahamas",
    "country_description": "The Bahamas, officially the Commonwealth of The Bahamas, is an island country within the Lucayan Archipelago of the Atlantic Ocean. It contains 97% of the Lucayan Archipelago's land area and 88% of its population. The archipelagic country consists of more than 3,000 islands, cays, and islets in the Atlantic Ocean, and is located north of Cuba and northwest of the island of Hispaniola and the Turks and Caicos Islands, southeast of the U.S. state of Florida and east of the Florida Keys. The capital is Nassau on the island of New Providence. The Royal Bahamas Defence Force describes the Bahamas' territory as encompassing 470,000 km2 (180,000 sq mi) of ocean space.",
    "country_capital": "Nassau",
    "country_population": 393248,
    "country_continent": "Americas",
    "country_language": "English",
    "country_currency": "Bahamian dollar ($)",
    "country_flag": "https://flagcdn.com/bs.svg"
  },
  {
    "country_name": "Kosovo",
    "country_description": "Kosovo, officially the Republic of Kosovo, is a country in Southeast Europe with partial diplomatic recognition. It is bordered by Albania to the southwest, Montenegro to the west, Serbia to the north and east, and North Macedonia to the southeast. It covers an area of 10,887 km2 (4,203 sq mi) and has a population of approximately 1.6 million. Kosovo has a varied terrain, with high plains along with rolling hills and mountains, some of which have an altitude over 2,500 m (8,200 ft). Its climate is mainly continental with some Mediterranean and alpine influences. Kosovo's capital and most populous city is Pristina; other major cities and urban areas include Prizren, Ferizaj, Gjilan and Peja.",
    "country_capital": "Pristina",
    "country_population": 1775378,
    "country_continent": "Europe",
    "country_language": "Albanian",
    "country_currency": "Euro (€)",
    "country_flag": "https://flagcdn.com/xk.svg"
  },
  {
    "country_name": "Kuwait",
    "country_description": "Kuwait, officially the State of Kuwait, is a country in West Asia. It is situated in the northern edge of the Arabian Peninsula at the tip of the Persian Gulf, bordering Iraq to the north and Saudi Arabia to the south. With a coastline of approximately 500 km (311 mi), Kuwait also shares a maritime border with Iran, across the Persian Gulf. Most of the country's population reside in the urban agglomeration of Kuwait City, the capital and largest city. As of 2024, Kuwait has a population of 4.82 million, of which 1.53 million are Kuwaiti citizens while the remaining 3.29 million are foreign nationals from over 100 countries. Kuwait has the third largest foreign-born population in the world.",
    "country_capital": "Kuwait City",
    "country_population": 4270563,
    "country_continent": "Asia",
    "country_language": "Arabic",
    "country_currency": "Kuwaiti dinar (د.ك)",
    "country_flag": "https://flagcdn.com/kw.svg"
  },
  {
    "country_name": "Maldives",
    "country_description": "The Maldives, officially the Republic of Maldives, and historically known as the Maldive Islands, is a country and archipelagic state in South Asia in the Indian Ocean. The Maldives is southwest of Sri Lanka and India, about 750 kilometres from the Asian continent's mainland. The Maldives' chain of 26 atolls stretches across the equator from Ihavandhippolhu Atoll in the north to Addu Atoll in the south.",
    "country_capital": "Malé",
    "country_population": 540542,
    "country_continent": "Asia",
    "country_language": "Maldivian",
    "country_currency": "Maldivian rufiyaa (.ރ)",
    "country_flag": "https://flagcdn.com/mv.svg"
  },
  {
    "country_name": "South Sudan",
    "country_description": "South Sudan, officially the Republic of South Sudan, is a landlocked country in East Africa. It is bordered on the north by Sudan; on the east by Ethiopia; on the south by the Democratic Republic of the Congo, Uganda and Kenya; and on the west by the Central African Republic. South Sudan's diverse landscape includes vast plains and plateaus, dry and tropical savannahs, inland floodplains, and forested mountains. The Nile River system is the defining physical feature of the country, running south to north across its center, which is dominated by a large swamp known as the Sudd. South Sudan has a population of 12.7 million. Juba is the capital and largest city.",
    "country_capital": "Juba",
    "country_population": 11193729,
    "country_continent": "Africa",
    "country_language": "English",
    "country_currency": "South Sudanese pound (£)",
    "country_flag": "https://flagcdn.com/ss.svg"
  },
  {
    "country_name": "Iran",
    "country_description": "Iran, officially the Islamic Republic of Iran (IRI) and also known as Persia, is a country in West Asia. It borders Turkey to the northwest and Iraq to the west, Azerbaijan, Armenia, the Caspian Sea, and Turkmenistan to the north, Afghanistan to the east, Pakistan to the southeast, the Gulf of Oman and the Persian Gulf to the south. With a multi-ethnic population of over 91 million in an area of 1,648,195 km2 (636,372 sq mi), Iran ranks 17th globally in both geographic size and population. It is the sixth-largest country entirely in Asia and one of the world's most mountainous countries. Officially an Islamic republic, Iran has a Muslim-majority population. The country is divided into five regions with 31 provinces. Tehran is the nation's capital, largest city and financial center.",
    "country_capital": "Tehran",
    "country_population": 83992953,
    "country_continent": "Asia",
    "country_language": "Persian (Farsi)",
    "country_currency": "Iranian rial (﷼)",
    "country_flag": "https://flagcdn.com/ir.svg"
  },
  {
    "country_name": "Albania",
    "country_description": "Albania, officially the Republic of Albania, is a country in Southeast Europe. It is located in the Balkans, on the Adriatic and Ionian Seas within the Mediterranean Sea, and shares land borders with Montenegro to the northwest, Kosovo to the northeast, North Macedonia to the east and Greece to the south. With an area of 28,748 km2 (11,100 sq mi), it has a varied range of climatic, geological, hydrological and morphological conditions. Albania's landscapes range from rugged snow-capped mountains in the Albanian Alps and the Korab, Skanderbeg, Pindus and Ceraunian Mountains, to fertile lowland plains extending from the Adriatic and Ionian seacoasts. Tirana is the capital and largest city in the country, followed by Durrës, Vlorë, and Shkodër.",
    "country_capital": "Tirana",
    "country_population": 2837743,
    "country_continent": "Europe",
    "country_language": "Albanian",
    "country_currency": "Albanian lek (L)",
    "country_flag": "https://flagcdn.com/al.svg"
  },
  {
    "country_name": "Brazil",
    "country_description": "Brazil, officially the Federative Republic of Brazil, is the largest and easternmost country in South America and Latin America. It is the world's fifth-largest country by area and one of the most populated countries. Its capital is Brasília, and its most populous city is São Paulo. Brazil is a federation composed of 26 states and a Federal District. It is the only country in the Americas where Portuguese is an official language. Brazil is among the world's most multicultural and ethnically diverse nations, due to over a century of mass immigration from around the world.",
    "country_capital": "Brasília",
    "country_population": 212559409,
    "country_continent": "Americas",
    "country_language": "Portuguese",
    "country_currency": "Brazilian real (R$)",
    "country_flag": "https://flagcdn.com/br.svg"
  },
  {
    "country_name": "Serbia",
    "country_description": "Serbia, officially the Republic of Serbia, is a landlocked country at the crossroads of Southeast and Central Europe, located in the Balkans and the Pannonian Plain. It borders Hungary to the north, Romania to the northeast, Bulgaria to the southeast, North Macedonia to the south, Croatia and Bosnia and Herzegovina to the west, and Montenegro to the southwest. Serbia claims a border with Albania through the disputed territory of Kosovo. Serbia has about 6.6 million inhabitants, excluding Kosovo. Its capital Belgrade is also the largest city.",
    "country_capital": "Belgrade",
    "country_population": 6908224,
    "country_continent": "Europe",
    "country_language": "Serbian",
    "country_currency": "Serbian dinar (дин.)",
    "country_flag": "https://flagcdn.com/rs.svg"
  },
  {
    "country_name": "Belize",
    "country_description": "Belize is a country on the north-eastern coast of Central America. It is bordered by Mexico to the north, the Caribbean Sea to the east, and Guatemala to the west and south. It also shares a maritime boundary with Honduras to the southeast. Belize is a member of the Caribbean Community (CARICOM), and is considered part of the Caribbean region and the historical British West Indies.",
    "country_capital": "Belmopan",
    "country_population": 397621,
    "country_continent": "Americas",
    "country_language": "Belizean Creole",
    "country_currency": "Belize dollar ($)",
    "country_flag": "https://flagcdn.com/bz.svg"
  },
  {
    "country_name": "Myanmar",
    "country_description": "Myanmar, officially the Republic of the Union of Myanmar and also rendered as Burma, is a country in northwest Southeast Asia. It is the largest country by area in Mainland Southeast Asia and has a population of about 55 million. It is bordered by India to its west, Bangladesh to its southwest, China to its northeast, Laos and Thailand to its east and southeast, and the Andaman Sea and the Bay of Bengal to its south and southwest. The country's capital city is Naypyidaw, and its largest city is Yangon.",
    "country_capital": "Naypyidaw",
    "country_population": 54409794,
    "country_continent": "Asia",
    "country_language": "Burmese",
    "country_currency": "Burmese kyat (Ks)",
    "country_flag": "https://flagcdn.com/mm.svg"
  },
  {
    "country_name": "Bhutan",
    "country_description": "Bhutan, officially the Kingdom of Bhutan, is a landlocked country in South Asia situated in the Eastern Himalayas between China in the north and India in the south, with the Indian state of Sikkim separating it from neighbouring Nepal. With a population of over 727,145 and a territory of 38,394 square kilometres (14,824 sq mi), Bhutan ranks 133rd in land area and 160th in population. Bhutan is a constitutional monarchy with a Druk Gyalpo (king) as the head of state and a prime minister as the head of government. The Je Khenpo is the head of the state religion, Vajrayana Buddhism.",
    "country_capital": "Thimphu",
    "country_population": 771612,
    "country_continent": "Asia",
    "country_language": "Dzongkha",
    "country_currency": "Bhutanese ngultrum (Nu.)",
    "country_flag": "https://flagcdn.com/bt.svg"
  },
  {
    "country_name": "Venezuela",
    "country_description": "Venezuela, officially the Bolivarian Republic of Venezuela, is a country on the northern coast of South America, consisting of a continental landmass and many islands and islets in the Caribbean Sea. It comprises an area of 916,445 km2 (353,841 sq mi), and its population was estimated at 29 million in 2022. The capital and largest urban agglomeration is the city of Caracas. The continental territory is bordered on the north by the Caribbean Sea and the Atlantic Ocean, on the west by Colombia, Brazil on the south, Trinidad and Tobago to the north-east and on the east by Guyana. Venezuela is a presidential republic consisting of 23 states, the Capital District and federal dependencies covering Venezuela's offshore islands. Venezuela is among the most urbanized countries in Latin America; the vast majority of Venezuelans live in the cities of the north and in the capital.",
    "country_capital": "Caracas",
    "country_population": 28435943,
    "country_continent": "Americas",
    "country_language": "Spanish",
    "country_currency": "Venezuelan bolívar soberano (Bs.S.)",
    "country_flag": "https://flagcdn.com/ve.svg"
  },
  {
    "country_name": "Liberia",
    "country_description": "Liberia, officially the Republic of Liberia, is a country on the West African coast. It is bordered by Sierra Leone to its northwest, Guinea to its north, Ivory Coast to its east, and the Atlantic Ocean to its south and southwest. It has a population of around 5.5 million and covers an area of 43,000 square miles (111,369 km2). The official language is English. Over 20 indigenous languages are spoken, reflecting the country's ethnic and cultural diversity. The capital and largest city is Monrovia.",
    "country_capital": "Monrovia",
    "country_population": 5057677,
    "country_continent": "Africa",
    "country_language": "English",
    "country_currency": "Liberian dollar ($)",
    "country_flag": "https://flagcdn.com/lr.svg"
  },
  {
    "country_name": "Jamaica",
    "country_description": "Jamaica is an island country in the Caribbean Sea and the West Indies. At 10,990 square kilometres (4,240 sq mi), it is the third-largest island—after Cuba and Hispaniola—of the Greater Antilles and the Caribbean. Jamaica lies about 145 km (78 nmi) south of Cuba, 191 km (103 nmi) west of Hispaniola, and 215 km (116 nmi) southeast of the Cayman Islands.",
    "country_capital": "Kingston",
    "country_population": 2961161,
    "country_continent": "Americas",
    "country_language": "English",
    "country_currency": "Jamaican dollar ($)",
    "country_flag": "https://flagcdn.com/jm.svg"
  },
  {
    "country_name": "Poland",
    "country_description": "Poland, officially the Republic of Poland, is a country in Central Europe. It extends from the Baltic Sea in the north to the Sudetes and Carpathian Mountains in the south, bordered by Lithuania and Russia to the northeast, Belarus and Ukraine to the east, Slovakia and the Czech Republic to the south, and Germany to the west. The territory is characterised by a varied landscape, diverse ecosystems, and temperate transitional climate. Poland is composed of sixteen voivodeships and is the fifth most populous member state of the European Union (EU), with over 38 million people, and the fifth largest EU country by land area, covering a combined area of 312,696 km2 (120,733 sq mi). The capital and largest city is Warsaw; other major cities include Kraków, Wrocław, Łódź, Poznań, Gdańsk, and Szczecin.",
    "country_capital": "Warsaw",
    "country_population": 37950802,
    "country_continent": "Europe",
    "country_language": "Polish",
    "country_currency": "Polish złoty (zł)",
    "country_flag": "https://flagcdn.com/pl.svg"
  },
  {
    "country_name": "Cayman Islands",
    "country_description": "The Cayman Islands is a self-governing British Overseas Territory, and the largest by population. The 264-square-kilometre (102-square-mile) territory comprises the three islands of Grand Cayman, Cayman Brac and Little Cayman, which are located south of Cuba and north-east of Honduras, between Jamaica and Mexico's Yucatán Peninsula. The capital city is George Town on Grand Cayman, which is the most populous of the three islands.",
    "country_capital": "George Town",
    "country_population": 65720,
    "country_continent": "Americas",
    "country_language": "English",
    "country_currency": "Cayman Islands dollar ($)",
    "country_flag": "https://flagcdn.com/ky.svg"
  },
  {
    "country_name": "Brunei",
    "country_description": "Brunei, officially Brunei Darussalam, is a country in Southeast Asia, situated on the northern coast of the island of Borneo. Apart from its coastline on the South China Sea, it is completely surrounded by the Malaysian state of Sarawak, with its territory bifurcated by the Sarawak district of Limbang. Brunei is the only sovereign state entirely on Borneo; the remainder of the island is divided between its multi-landmass neighbours of Malaysia and Indonesia. As of 2023, the country had a population of 455,858, of whom approximately 180,000 resided in the capital and largest city of Bandar Seri Begawan. Its official language is Malay and Islam is the state religion of the country, although other religions are nominally tolerated. The government of Brunei is an absolute monarchy ruled by the Sultan, and it implements a fusion of English common law and jurisprudence inspired by Islam, including sharia.",
    "country_capital": "Bandar Seri Begawan",
    "country_population": 437483,
    "country_continent": "Asia",
    "country_language": "Malay",
    "country_currency": "Brunei dollar ($)",
    "country_flag": "https://flagcdn.com/bn.svg"
  },
  {
    "country_name": "Comoros",
    "country_description": "The Comoros, officially the Union of the Comoros, is an archipelagic country made up of three islands in Southeastern Africa, located at the northern end of the Mozambique Channel in the Indian Ocean. Its capital and largest city is Moroni. The religion of the majority of the population, and the official state religion, is Sunni Islam. Comoros proclaimed its independence from France on 6 July 1975. The Comoros is the only country of the Arab League which is entirely in the Southern Hemisphere. It is a member state of the African Union, the Organisation internationale de la Francophonie, the Organisation of Islamic Co-operation, and the Indian Ocean Commission. The country has three official languages: Shikomori, French and Arabic.",
    "country_capital": "Moroni",
    "country_population": 869595,
    "country_continent": "Africa",
    "country_language": "Arabic",
    "country_currency": "Comorian franc (Fr)",
    "country_flag": "https://flagcdn.com/km.svg"
  },
  {
    "country_name": "Guam",
    "country_description": "Guam is an organized, unincorporated territory of the United States in the Micronesia subregion of the western Pacific Ocean. Guam's capital is Hagåtña, and the most populous village is Dededo. It is the westernmost point and territory of the United States, reckoned from the geographic center of the U.S. In Oceania, Guam is the largest and southernmost of the Mariana Islands and the largest island in Micronesia. As of 2022, its population was 168,801. Chamorros are its largest ethnic group, but a minority on the multiethnic island. The territory spans 210 square miles and has a population density of 775 per square mile (299/km2).",
    "country_capital": "Hagåtña",
    "country_population": 168783,
    "country_continent": "Oceania",
    "country_language": "Chamorro",
    "country_currency": "United States dollar ($)",
    "country_flag": "https://flagcdn.com/gu.svg"
  },
  {
    "country_name": "Tonga",
    "country_description": "Tonga, officially the Kingdom of Tonga, is an island country in Polynesia, part of Oceania. The country has 171 islands – of which 45 are inhabited. Its total surface area is about 750 km2 (290 sq mi), scattered over 700,000 km2 (270,000 sq mi) in the southern Pacific Ocean. As of 2021, according to Johnson's Tribune, Tonga has a population of 104,494, 70% of whom reside on the main island, Tongatapu. The country stretches approximately 800 km north-south. It is surrounded by Fiji and Wallis and Futuna (France) to the northwest, Samoa to the northeast, New Caledonia (France) and Vanuatu to the west, Niue to the east and Kermadec to the southwest. Tonga is about 1,800 km from New Zealand's North Island.",
    "country_capital": "Nuku'alofa",
    "country_population": 105697,
    "country_continent": "Oceania",
    "country_language": "English",
    "country_currency": "Tongan paʻanga (T$)",
    "country_flag": "https://flagcdn.com/to.svg"
  },
  {
    "country_name": "Kiribati",
    "country_description": "Kiribati, officially the Republic of Kiribati, is an island country in the Micronesia subregion of Oceania in the central Pacific Ocean. Its permanent population is over 119,000 as of the 2020 census, with more than half living on Tarawa atoll. The state comprises 32 atolls and one remote raised coral island, Banaba. Its total land area is 811 km2 (313 sq mi) dispersed over 3,441,810 km2 (1,328,890 sq mi) of ocean.",
    "country_capital": "South Tarawa",
    "country_population": 119446,
    "country_continent": "Oceania",
    "country_language": "English",
    "country_currency": "Australian dollar ($)",
    "country_flag": "https://flagcdn.com/ki.svg"
  },
  {
    "country_name": "Ghana",
    "country_description": "Ghana, officially the Republic of Ghana, is a country in West Africa. It lies adjacent to the Gulf of Guinea and the Atlantic Ocean to the south, sharing a border with Ivory Coast in the west, Burkina Faso in the north, and Togo in the east. Ghana covers an area of 239,567 km2 (92,497 sq mi), spanning diverse ecologies, from coastal savannas to tropical rainforests. With nearly 35 million inhabitants, Ghana is the second-most populous country in West Africa. The capital and largest city is Accra; other significant cities include Kumasi, Tamale, and Sekondi-Takoradi. In 1957 Ghana became the first colony in Sub-Saharan Africa to achieve sovereignty, under the leadership of Kwame Nkrumah.",
    "country_capital": "Accra",
    "country_population": 31072945,
    "country_continent": "Africa",
    "country_language": "English",
    "country_currency": "Ghanaian cedi (₵)",
    "country_flag": "https://flagcdn.com/gh.svg"
  },
  {
    "country_name": "Chad",
    "country_description": "Chad, officially the Republic of Chad, is a landlocked country located at the crossroads of North and Central Africa. It is bordered by Libya to the north, Sudan to the east, the Central African Republic to the south, Cameroon to the southwest, Nigeria to the southwest, and Niger to the west. Chad has a population of 16 million, of which 1.6 million live in the capital and largest city of N'Djamena. With a total area of around 1,300,000 km2 (500,000 sq mi), Chad is the fifth-largest country in Africa and the twentieth largest nation by area in the world.",
    "country_capital": "N'Djamena",
    "country_population": 16425859,
    "country_continent": "Africa",
    "country_language": "Arabic",
    "country_currency": "Central African CFA franc (Fr)",
    "country_flag": "https://flagcdn.com/td.svg"
  },
  {
    "country_name": "Zimbabwe",
    "country_description": "Zimbabwe, officially the Republic of Zimbabwe, is a landlocked country in Southeast Africa, between the Zambezi and Limpopo Rivers, bordered by South Africa to the south, Botswana to the southwest, Zambia to the north, and Mozambique to the east. The capital and largest city is Harare, and the second largest is Bulawayo.",
    "country_capital": "Harare",
    "country_population": 14862927,
    "country_continent": "Africa",
    "country_language": "Chibarwe",
    "country_currency": "Zimbabwean dollar ($)",
    "country_flag": "https://flagcdn.com/zw.svg"
  },
  {
    "country_name": "Saint Martin",
    "country_description": "Saint Martin may refer to:",
    "country_capital": "Marigot",
    "country_population": 38659,
    "country_continent": "Americas",
    "country_language": "French",
    "country_currency": "Euro (€)",
    "country_flag": "https://flagcdn.com/mf.svg"
  },
  {
    "country_name": "Mongolia",
    "country_description": "Mongolia is a landlocked country in East Asia, bordered by Russia to the north and China to the south. It covers an area of 1,564,116 square kilometres, with a population of 3.5 million, making it the world's most sparsely populated sovereign state. Mongolia is the world's largest landlocked country that does not border a closed sea, and much of its area is covered by grassy steppe, with mountains to the north and west and the Gobi Desert to the south. Ulaanbaatar, the capital and largest city, is home to roughly half of the country's population.",
    "country_capital": "Ulan Bator",
    "country_population": 3278292,
    "country_continent": "Asia",
    "country_language": "Mongolian",
    "country_currency": "Mongolian tögrög (₮)",
    "country_flag": "https://flagcdn.com/mn.svg"
  },
  {
    "country_name": "Portugal",
    "country_description": "Portugal, officially the Portuguese Republic, is a country in the Iberian Peninsula in Southwestern Europe. Featuring the westernmost point in continental Europe, Portugal borders Spain to its north and east, with which it shares the longest uninterrupted border in the European Union; to the south and the west is the North Atlantic Ocean; and to the west and southwest lie the Macaronesian archipelagos of the Azores and Madeira, which are two autonomous regions of Portugal. Lisbon is the capital and largest city, followed by Porto, which is the only other metropolitan area.",
    "country_capital": "Lisbon",
    "country_population": 10305564,
    "country_continent": "Europe",
    "country_language": "Portuguese",
    "country_currency": "Euro (€)",
    "country_flag": "https://flagcdn.com/pt.svg"
  },
  {
    "country_name": "American Samoa",
    "country_description": "American Samoa is an unincorporated territory of the United States located in the Polynesia region of the South Pacific Ocean. Centered on 14.3°S 170.7°W, it is 40 miles (64 km) southeast of the island country of Samoa, east of the International Date Line and the Wallis and Futuna Islands, west of the Cook Islands, north of Tonga, and some 310 miles (500 km) south of Tokelau. American Samoa is the southernmost territory of the United States, situated 2,200 miles (3,500 km) southwest of the U.S. state of Hawaii, and one of two U.S. territories south of the Equator, along with the uninhabited Jarvis Island.",
    "country_capital": "Pago Pago",
    "country_population": 55197,
    "country_continent": "Oceania",
    "country_language": "English",
    "country_currency": "United States dollar ($)",
    "country_flag": "https://flagcdn.com/as.svg"
  },
  {
    "country_name": "Republic of the Congo",
    "country_description": "The Republic of the Congo, also known as Congo-Brazzaville, the Congo Republic or simply either Congo or the Congo, is a country located on the western coast of Central Africa to the west of the Congo River. It is bordered to the west by Gabon, to the northwest by Cameroon, to the northeast by the Central African Republic, to the southeast by the Democratic Republic of the Congo, to the south by the Angolan exclave of Cabinda, and to the southwest by the Atlantic Ocean.",
    "country_capital": "Brazzaville",
    "country_population": 5657000,
    "country_continent": "Africa",
    "country_language": "French",
    "country_currency": "Central African CFA franc (Fr)",
    "country_flag": "https://flagcdn.com/cg.svg"
  },
  {
    "country_name": "Belgium",
    "country_description": "Belgium, officially the Kingdom of Belgium, is a country in Northwestern Europe. The country is bordered by the Netherlands to the north, Germany to the east, Luxembourg to the southeast, France to the south, and the North Sea to the west. It covers an area of 30,689 km2 (11,849 sq mi) and has a population of more than 11.7 million. With 383/km2 (990/sq mi), Belgium's population density ranks 22nd in the world and 6th in Europe. Belgium is part of an area known as the Low Countries, historically a somewhat larger region than the Benelux group of states, as it also included parts of northern France. The capital and largest metropolitan region is Brussels; other major cities are Antwerp, Ghent, Charleroi, Liège, Bruges, Namur, and Leuven.",
    "country_capital": "Brussels",
    "country_population": 11555997,
    "country_continent": "Europe",
    "country_language": "German",
    "country_currency": "Euro (€)",
    "country_flag": "https://flagcdn.com/be.svg"
  },
  {
    "country_name": "Israel",
    "country_description": "Israel, officially the State of Israel, is a country in the Southern Levant region of West Asia. It is bordered by Lebanon and Syria to the north, the West Bank and Jordan to the east, the Gaza Strip and Egypt to the southwest, and the Mediterranean Sea to the west. The country also has a small coastline on the Red Sea at its southernmost point, and part of the Dead Sea lies along its eastern border. Israel's proclaimed capital is in Jerusalem, while Tel Aviv is the country's largest urban area and economic center.",
    "country_capital": "Jerusalem",
    "country_population": 9216900,
    "country_continent": "Asia",
    "country_language": "Arabic",
    "country_currency": "Israeli new shekel (₪)",
    "country_flag": "https://flagcdn.com/il.svg"
  },
  {
    "country_name": "New Zealand",
    "country_description": "New Zealand is an island country in the southwestern Pacific Ocean. It consists of two main landmasses—the North Island and the South Island —and over 600 smaller islands. It is the sixth-largest island country by area and lies east of Australia across the Tasman Sea and south of the islands of New Caledonia, Fiji, and Tonga. The country's varied topography and sharp mountain peaks, including the Southern Alps, owe much to tectonic uplift and volcanic eruptions. New Zealand's capital city is Wellington, and its most populous city is Auckland.",
    "country_capital": "Wellington",
    "country_population": 5084300,
    "country_continent": "Oceania",
    "country_language": "English",
    "country_currency": "New Zealand dollar ($)",
    "country_flag": "https://flagcdn.com/nz.svg"
  },
  {
    "country_name": "Nicaragua",
    "country_description": "Nicaragua, officially the Republic of Nicaragua, is the geographically largest country in Central America, comprising 130,370 km2 (50,340 sq mi). With a population of 7,142,529 as of 2024, it is the third-most populous country in Central America after Guatemala and Honduras.",
    "country_capital": "Managua",
    "country_population": 6624554,
    "country_continent": "Americas",
    "country_language": "Spanish",
    "country_currency": "Nicaraguan córdoba (C$)",
    "country_flag": "https://flagcdn.com/ni.svg"
  },
  {
    "country_name": "Anguilla",
    "country_description": "Anguilla is a British Overseas Territory in the Caribbean. It is one of the most northerly of the Leeward Islands in the Lesser Antilles, lying east of Puerto Rico and the Virgin Islands and directly north of Saint Martin. The territory consists of the main island of Anguilla, approximately 16 miles long by 3 miles (5 km) wide at its widest point, together with a number of much smaller islands and cays with no permanent population. The territory's capital is The Valley. The total land area of the territory is 35 square miles (91 km2), with a population of approximately 15,753 (2021).",
    "country_capital": "The Valley",
    "country_population": 13452,
    "country_continent": "Americas",
    "country_language": "English",
    "country_currency": "Eastern Caribbean dollar ($)",
    "country_flag": "https://flagcdn.com/ai.svg"
  }
]
